export const ambia_dua = `
:سیدنا آدم علیہ السلام کی دعا
رَبَّنَا ظَلَمْنَآ اَنْفُسَـنَا وَاِنْ لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِیْنَ
اے ہمارے پروردگار ہم نے اپنی جانوں پر ظلم کیا اور اگر تو
ہمیں نہیں بخشے گا اور ہم پر رحم نہیں کرے گا تو ہم تباه ہو
جائیں گے ۔
23سورة الاعراف:
:سیدنا ابوب علیہ االسلام کی دعا
اَنِّىْ مَسَّنِيَ الضُّرُّ وَاَنْتَ اَرْحَـمُ الرّٰحِمِیْنَ
مجھے ایذا ہو رہی ہے اور تو سب سے بڑھ کر رحم کرنے والا
ہے ۔
83سورة الانبیاء:
رَبِّ اغْفِرْ لِيْ وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَیْتِيَ مُؤْمِنًا وَّلِلْمُؤْمِنِیْنَ
ۭ وَلاَ تَزِدِ الظّٰلِـمِیْنَ اِلاَّ تَبَارًا٠وَالْمُؤْمِنٰتِ۝اے میرے پروردگار مجھ کو اور میرے ماں باپ کو اور جو
ایمان لا کر میرے گھر میں آئے اس کو اور تمام ایمان والے
مردوں اور ایمان والی عورتوں کو معاف فرما اور ظالم لوگوں
کے لئے اور زیاده تباہی بڑھا
28سورةنوح:
:سیدنا ابراھیم کی دعا
ۖۤ ۗ رَبَّنَا وَتَقَبَّلْ دُعَاءِ٠رَبِّ اجْعَلْنِيْ مُقِیْمَ الصَّلٰوةِ وَمِنْ ذُرِّیَّتِيْ۝اے پروردگار مجھ کو (ایسی توفیق عنایت) کر کہ نماز پڑھتا
رہوں اور میری اولاد کو بھی (یہ توفیق بخش) اے پروردگار
میری دعا قبول فرما ۔
40سورةا براھیم:
سیدنا یونس علیہ السلام کی دعا
لآَ اِلٰہَ اِلآَّ اَنْتَ سُبْحٰــنَكَ اِنِّىْ كُنْتُ مِنَ الظّٰلِــمِیْنَ
تیرے سوا کوئی معبود نہیں۔ تو پاک ہے (اور) بےشک میں
قصوروار ہوں ۔
(87سورة الانبیاء:)
ۚ تَوَفَّنِيْ مُسْلِمًا وَّاَلْحِقْنِيْ بِالصّٰلِحِیْنَ٠۝اَنْتَ وَلِيّٖ فِي الدُّنْیَا وَالاْٰخِرَةِ۝
تو ہی دنیا اور آخرت میں میرا کارساز ہے۔ تو مجھے (دنیا سے)
اپنی اطاعت (کی حالت) میں اٹھائیو اور (آخرت میں) اپنے نیک
بندوں میں داخلرَبَّنَا افْتَحْ بَیْنَنَا وَبَیْنَ قَوْمِنَا بِالْحَقِّ وَاَنْتَ خَیْرُ الْفٰتِحِیْنَ۝اے پروردگار ہم میں اور ہماری قوم میں انصاف کے ساتھ
فیصلہ کردے اور تو سب سے بہتر فیصلہ کرنے والا ہے
(89سورة الاعراف:)`