export const aulad_ki_bandish = `
اولاد کی بندش کا مسئلہ
اولاد الله تعالیٰ کی نعمت ہے اگر کسی انسان کی اولاد نہ ہو
تو اس کی دو وجوہات ہو سکتی ہیں۔طبعی یاجادو کی وجہ
سے۔
اکثرجن لوگوں کو طبعی طور پر رپوٹ دُرست ہوتی ہے
مگر ان کو جاود کر کے اُولاد کے معاملے میں رکاوٹ
ڈالی گئی ہوتی ہے اس کا علاج مندرجہ ذیل ہے
:علاج مرتبہ7سورة الفاتحہ
 مرتبہ7 قل 3آخری
مرتبہ100 یَاالله ، یَا خَالِقُ،یَا مُصَّوِّرُ ، یَا مُطِیْعُ
مرتبہ100رَبِّ ھَبْ لِیْ مِنَ الصَّالِحِیْنَ
 مرتبہ1سوره مریم اور سوره محمد
 مرتبہ100دورد ابراھیمی
 مرتبہ1000استغفر الله
یہ ساری پڑھائی دن میں ایک مرتبہ کرنی ہے اس کو دو
حصوں میں بھی تقسیم کیا جا سکتا ہے ۔
 مرتبہ سنیں جواس 1اس کے ساتھ یہ رقیہ بھی روزانہ
ویڈیو لنک میں موجود ہے۔
https://youtu.be/j3asGdKqOIkاس کی مزید تفصیل کے لئے اس ویڈیو کو دیکھیں
https://youtu.be/krna1jWsyzQ`