export const ISTEKHARA_DATA = "﷽"+"\n"+
"استخارہ خود کیجئے:"+"\n"+
"استخارہ کا مطلب ہے اللہ تعالیٰ سے مشورہ کرنا،اپنے کام کے بارہ میں کہ میرا یہ کام کرنا بہتر ہو گا یا نہیں؟"+"\n"+
"استخارہ صرف اس عمل کا نام ہے جو انسان اللہ سے مشورہ کرتا ہے۔استخارہ کرنے کے بعد یا توانسان کو کوئی اشارہ مل جاتا ہےیا جو کام اس کے لئے بہتر ہو گا اللہ اس کا م کی طرف رہنمائی فرما دیتا ہے۔"+"\n"+
"اس کے علاوہ کسی کو چیک کرنے کیلئے یا حساب کرنے کا نام استخارہ نہیں ہے۔وہ ہم نے اوپر(خود کو چیک کرے آپ پر جادوو جنات کا مسئلہ ہےیا نہیں) کا مکمل طریقہ بتادیاہے اس لئے استخارہ کرنے سے پہلے استخارہ کا مطلب سمجھنا ضروری ہے"+"\n"+
"استخارہ کا طریقہ:"+"\n"+
"سیدنا جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں تمام کاموں میں استخارہ کی تعلیم اس طرح دیا کرتے تھے، جس طرح قرآن مجید کی سورت سکھلایا کرتے تھے، آپ صلی اللہ علیہ وسلم فرماتے ہیں: تم میں سے اگر کوئی شخص کسی کام کا ارادہ کرے تو وہ(فرض کے علاوہ)دورکعت نماز ادا کرے اور پھر یہ کہے:"+"\n"+
"اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ العَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلَّامُ الغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاقْدُرْهُ لِي، وَيَسِّرْهُ لِي، ثُمَّ بَارِكْ لِي فِيهِ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِي الخَيْرَ حَيْثُ كَانَ، ثُمَّ أرْضِنِي بِه"+"\n"+
"اے اللہ! بے شک میں تجھ سے تیرے علم کے ذریعے خیر طلب کرتا ہوں، اور تیری قدرت کے ذریعے طاقت مانگتا ہوں، اور میں تیرے عظیم فضل کا سوال کرتا ہوں، کیونکہ تو قدرت رکھتا ہے اور میں قدرت نہیں رکھتا، اور تو جانتا ہے اور میں نہیں جانتا۔ اور تو غیب کے امور جاننے والا ہے، اے اللہ! اگر تو جانتا ہے کہ یہ کام(کام کا نام لے)میرے لئے میرے دین میں میری معاش ، اور میری آخرت کے انجام کے لئے بہتر ہے تو اسے میرے مقدر میں کردے، اور اسے میرے لئےآسان کردے، پھر میرے لئے اس میں برکت ڈال۔ اور اگر تو جانتا ہے کہ یہ کام (کام کانام لے)میرے لئے میرے دین میں، میری معاش اور میری آخرت کے انجام کے لئے برا ہے تو اسے مجھ سے ہٹا دے اور مجھے اس سے ہٹادے اور میرے لئے بھلائی کردے جہاں کہیں بھی ہوپھر مجھے اس پر راضی کردے۔"+"\n"+
"(صحیح بخاری:6382"+"\n"+
"استخارہ کرنےوالاسب سے پہلے دو رکعت نماز پڑھے پھر دعائے استخارہ پڑھے ، پھر (ھٰذا الامر)کی جگہ اپنا کام بولے ،تو پھر مکمل استخارہ کی دعا پڑھے۔ 3 مرتبہ"+"\n"+
"پھر ہاتھ اٹھا کر دعا کرے اپنی حاجت اللہ کے سامنے رکھے۔"+"\n"+
"یہ عمل مسلسل 7 دن تک کرے ،اس کے بعد اپنا کا م کرے۔اگر کام بہتر ہوگا تو اللہ تعالیٰ وہ کام آسان کر دے گا اور اگر وہ کام آپ کے لئے بہتر نہیں تو اللہ اس کام میں کوئی رکاوٹ ڈال دے گا۔اور آپ کی بہتر کام کی طرف رہنمائی کر دی جائے گی۔"+"\n"+
"اس مسئلہ میں مکمل رہنمائی لینے کیلئے ہمارے یوٹیوب چینل قرآن سے روحانی علاج کو کھول کر اس لنک میں ویڈیو دیکھیں۔"+"\n"
export const ISTEKHARA_DATA_LINK = "https://youtu.be/-zcaxVK-J7o"

export const ANBIA_KI_DUAEN_DATA = "سیدنا آدم علیہ السلام کی دعا:"+
"رَبَّنَا ظَلَمْنَآ اَنْفُسَـنَا وَاِنْ لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ"+
"اے ہمارے پروردگار ہم نے اپنی جانوں پر ظلم کیا اور اگر تو ہمیں نہیں بخشے گا اور ہم پر رحم نہیں کرے گا تو ہم تباہ ہو جائیں گے ۔"+
"سورۃ الاعراف:23"+
"سیدنا ابوب علیہ االسلام کی دعا:"+
"اَنِّىْ مَسَّنِيَ الضُّرُّ وَاَنْتَ اَرْحَـمُ الرّٰحِمِيْنَ"+
"مجھے ایذا ہو رہی ہے اور تو سب سے بڑھ کر رحم کرنے والا ہے ۔"+
"سورۃ الانبیاء:83"+
"رَبِّ اغْفِرْ لِيْ وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَّلِلْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِ۝۰ۭ وَلَا تَزِدِ الظّٰلِـمِيْنَ اِلَّا تَبَارًا"+
"اے میرے پروردگار مجھ کو اور میرے ماں باپ کو اور جو ایمان لا کر میرے گھر میں آئے اس کو اور تمام ایمان والے مردوں اور ایمان والی عورتوں کو معاف فرما اور ظالم لوگوں کے لئے اور زیادہ تباہی بڑھا"+
"سورۃنوح:28"+
"سیدنا ابراھیم کی دعا:"+
"رَبِّ اجْعَلْنِيْ مُقِيْمَ الصَّلٰوۃِ وَمِنْ ذُرِّيَّتِيْ۝۰ۤۖ رَبَّنَا وَتَقَبَّلْ دُعَاۗءِ"+
"اے پروردگار مجھ کو (ایسی توفیق عنایت) کر کہ نماز پڑھتا رہوں اور میری اولاد کو بھی (یہ توفیق بخش) اے پروردگار میری دعا قبول فرما ۔"+
"سورۃا براھیم:40"+
"سیدنا یونس علیہ السلام کی دعا"+
"لَآ اِلٰہَ اِلَّآ اَنْتَ سُبْحٰــنَكَ اِنِّىْ كُنْتُ مِنَ الظّٰلِــمِيْنَ"+
"تیرے سوا کوئی معبود نہیں۔ تو پاک ہے (اور) بےشک میں قصوروار ہوں ۔"+
"(سورۃ الانبیاء:87)"+
"اَنْتَ وَلِيّٖ فِي الدُّنْيَا وَالْاٰخِرَۃِ۝۰ۚ تَوَفَّنِيْ مُسْلِمًا وَّاَلْحِقْنِيْ بِالصّٰلِحِيْنَ۝"+
"تو ہی دنیا اور آخرت میں میرا کارساز ہے۔ تو مجھے (دنیا سے) اپنی اطاعت (کی حالت) میں اٹھائیو اور (آخرت میں) اپنے نیک بندوں میں داخل"+
"رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَاَنْتَ خَيْرُ الْفٰتِحِيْنَ۝"+
"اے پروردگار ہم میں اور ہماری قوم میں انصاف کے ساتھ فیصلہ کردے اور تو سب سے بہتر فیصلہ کرنے والا ہے"+
"(سورۃ الاعراف:89)"
