export const istekhara = `
﷽:ارہد
ارہ ا ٰ رہ ،ا م 
رہ ا م      ؟
ارہف اس   م  ان ا  رہ
   ان   ارہ 
۔ا
:ارہ
ر ا     رل ا  ا 
 مں  ارہ   اس ح د 
و ، آپ
،ح آن   رت 
 ا و  :    ا  
م ارادہے  وہ(ض  وہ)دور
ز اداے اور  
:اُّّ إِّ أَُِْكَ َِِِْ، وَأَِْْرُكَ ُِْرََِ، وَأَُْ ِْ
ََِْ اَِِ، ََّ َِْرُ وََ أِْرُ، وََ
 ذر  
اے ا!      ے
 ں، اور ی ت  ذر   ں، اور
 ے    ال  ں،   رت
ر  اور  رت  ر، اور    اور 
 ار  وا ، اے ا! ا
 ۔ اور 
     م(م  م )ے  ے د
 
وا   دو ر ز  
اہ
د ارہ  ،  (ٰا ا)  ا م 
3   ، ارہ  د ۔

  ا  د ے ا  ا   ر۔
 دن  ے ،س   ا  م 7  
ے۔ا م    ا ٰ وہ 
`