export const jaddu_check = `
کیا آپ پر جادو ہے خود چیک کریں
یاد رہے کہ اگر ان علامات میں سے کوئی علامت نہیں ہو تو آپ پر
جادو نہیں ہے۔
خواب میں جانور کو پیچھے لگا دیکھنا .1
خواب میں سانپ کو پیچھے لگا دیکھنا .2
خواب میں چھپکلی اپنے اوپر یا برتنوں میں دیکھنا .3
خواب میں کتے کو دیکھنا کہ وه پیچھے لگا ہواہے .4
۔ خواب میں بلی کو حملہ کرتے دیکھنا5
۔خواب میں اپنے آپ کو اونچی جگہ سے گرتا ہوا دیکھنا6
۔ خواب میں اونچائی پر چڑھنے کی کوشش کرنا مگر چڑھ نہیں پانا۔7
۔خواب میں اپنے آپ کو کسی کام میں بے بس محسوس کرنا8
۔خواب میں اپنے آپ کو بند راستوں میں پھنسے دیکھنا9
۔ خواب میں خود کو گندگی میں پھنسے دیکھنا10
(حالت بیداری میں)
۔ دم کے ذریعے جادو کی تشخیص11
۔آپ پر یا آپ کے گھر پر خون کے چھینٹے گرنا12
۔گھر میں گوشت کا آنا13
۔کپڑوں کا خود بخود کٹ جانا14
۔بالوں کا درمیان سے کٹ جانا15
۔گھر میں تعویز یا سوئیاں ملنا16
۔گھر میں پانی کے چھینٹے پڑنا17
۔ اسلام کے بارے میں کفریہ خیالات کا آنا18
۔ یہ محسوس کرنا کہ کوئی آپ کو دیکھ رہا ہے یا ساتھ ہے19
: خواب میں جانور پیچھے لگا دیکھنا .1
یہ خواب ایک بہت بڑے عمل کی نشانی ہے. جس بندے کو یہ خواب
آئے کہ اس کے پیچھے کوئی بھی جانور اسے نقصان یا مارنے کی
غرض سے پیچھے لگا ہوا ہے. اس کو معلوم ہونا چاہیئے کہ یہ جادو
کی ایک علامت ہے اور یہ جادو جنات کے ذریعے ہو سکتا ہے. اس
عمل میں جادوگر جنات کو جادو کے ذریعہ بھیجتا ہے جو اس بندے کو
پریشان کرتے ہیں. الله تعالیٰ کی طرف سے خواب میں انسان کو یہ
اشاره ہوتا ہے کہ وه اس شیطانی شر سے خود کو بچائے۔ اس کا علاج
انسان خود کر سکتا ہے جو کہ مندرجہ ذیل ہے۔(نیز یہ یاد رہے کہ
خواب میں جانور کو دیکھنا جو کہ آپ کا نقصان نہیں کر رہاہو یہ جادو
کی قسم نہیں ہے)
سب سے پہلے اس خواب کا اثر زائل کرے
خواب کا اثرزائل کرے جیسا کہ اس لنک میں بتایا گیا ہے
 https://youtu.be/484R0tyhnqY علاج
 مرتبہ7سورة فاتحہ
 مرتبہ7آیت الکرسی
 مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ7آخری تین قل
لاَ اِلٰہَ اِلاَّ الله وَحْدَه لاَ شَرِیْکَ لَہٗ لَہٗ الْمُلْکُ وَلَہٗ الْحَمْدُ وَھُوَ عَلٰی کُلِّ شَیْئٍ
قَدِیْرٌ
 مرتبہ صبح و شام100 ( 3474 )ترمذی
نوٹ: یہ پڑھائی صبح و شام پانی اور تیل پر دم کر کے پانی پینا ہے
اور تیل جسم پر لگا کر نہانا ہے۔
 ماه کرنا ہے ان شاء الله مسئلہ حل ہو جائے گا۔1یہ عمل مسلسل
اس کے ساتھ رقیہ دم صبح و شام ایک ایک مرتبہ سننا ہے جو مندرجہ
ذیل لنک میں موجود ہے https://youtu.be/j3asGdKqOIk (اس عمل کی تفصیل اس ویڈیو لنک میں موجود ہے)
 https://youtu.be/9u7jVaUtnQ8 :خواب میں سانپ پیچھے لگا دیکھنا .2
اگر آپ کو خواب میں سانپ نظر آئے جو کہ آپ کو ڈسنے یا نقصان
پہنچانے کو کوشش کر رہا ہے تو یہ ایک مختلف قسم کے جادو کی
علامت ہے. سانپ کی رنگت اور نوعیت دیکھ کر پتہ چل سکتا ہے کہ
یہ کس قسم کا جادو ہے. کیونکہ مختلف رنگ کے سانپ خواب میں 
نظر آنا دوسری بہت سی جادو کی اقسام کو ظاہر کرتے ہیناور یہ ظاہر
کرتا ہے کہ جادو غیر مسلم جنات کے ذریعہ کروایا گیا ہے اور یہ
یہودی یا عیسائی جنات کی علامت بھی ہو سکتاہے۔ایسے جادو کا ہم
خود کیسے علاج کر سکتے ہیں؟ ہم نے الله کے حکم سے پڑھائی کر
کے جنات کو کمزور کرنا ہے اور جادو کو بے اثر کرنا ہے۔(یاد رہے
کہ اگر سانپ نقصان نہ پہنچا رہا ہو یا سانپ کوخواب میں ویسے
دیکھے تو یہ جادو کی علامت نہیں ہے)۔
:علاج مرتبہ7سورة فاتحہ
 مرتبہ7آیت الکرسی
 مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ100 (69-68-67سورة طہ کی آیت (
 مرتبہ7آخری تین قل
 مرتبہ100درودِ ابراہیمی
یہ رقیہ دم صبح و شام ایک ایک مرتبہ سنناہے۔جو اس لنک میں
موجودہے۔
 https://youtu.be/j3asGdKqOIk نوٹ: یہ پڑھائی صبح و شام پانی پر دم کر کے پینا اور تیل پر دم کر
کے جسم پر لگا کر نہانا ہے۔
یہ عمل مسلسل ایک ماه کرنا ہے ان شاء الله مسئلہ حل ہو جائے گا۔
اس کی تفصیل ہماری اس ویڈیو میں دی گئی ہے
 https://youtu.be/ltA0KQVawE8 : خواب میں چھپکلی برتنوں میں دیکھنا .3
خواب میں چھپکلی دیکھنے کے مختلف تعبیریں ہو سکتی ہیں۔ مگر
اپنے اوپر یا کھانے والی چیزوں میں یا کپڑوں پر چھپکلی دیکھنا
خطرناک جادو کی علامت ہے۔ اس کی کچھ اورتعبیرینبھی ہو سکتی ہیں
جیسا کہ کوئی عورت دشمن یا جادوگر ہونے کا اشاره بھی ہو سکتا ہے
مگر یہاں ہمارا موضوع صرف اور صرف جادو ہے۔ یہ خواب دیکھنے
والے مریض پر سحرِ امراض یعنی بیماری کا جادو ہو سکتا ہے. اس کا
فوری علاج کرنا ضروری ہے. یاد رہے کہ ویسے خواب میں چھپکلی
دیکھنا جادو نہیں ہے ہاں البتہ چھپکلی کو اپنے جسم کے اوپر یا برتنوں
میں دیکھنا جادو ہو سکتاہے۔
سب سے پہلے خواب کا اثر زائل کریں۔
(خواب کا اثر زائل کرنے کا طریقہ اس لنک میں موجود ہے۔)
 https://youtu.be/484R0tyhnqY :علاج مرتبہ7سورة فاتحہ
 مرتبہ7آیت الکرسی
 مرتبہ7 آیات 2سورة البقره کی آخری
 سو مرتبہ81سورة یونس کی آیت نمبر
 مرتبہ1سورة الرحمٰن 
 مرتبہ7آخری تین قل
یہ عمل ایک ماه تک صبح و شام پانی اور تیل پر دم کر کے پانی پی
لے اور تیل لگا کر نہا لے۔
:اس مسئلے کی تفصیل اس ویڈیو میں دی گئی ہے لنک
 (https://youtu.be/ltA0KQVawE8) جو اس لنک اس کے ساتھ صبح و شام ایک ایک مرتبہ رقیہ دم سنیں
میں موجود ہے۔
 https://youtu.be/j3asGdKqOIk خواب میں کتے کو دیکھنا کہ وه پیچھے لگا ہوہے۔ :4
یہ کالے جادو کی علامت ہے. خواب میں کتا اگر صرف پیچھے لگا
نظر آئے تو سمجھ جائیں کہ آپ پر جادو ہو رہا ہے اور اگر کتا کاٹ
لے تو جادو ہو چکا ہے. فوری طور پر اس کے علاج پر توجہ دیں. یہ
خواب ظاہر کرتا ہے کہ جادو جنات کے ذریعہ سے کروایا گیا ہے اور
یہ جنات یہودی یا عیسائی ہو سکتے ہیں اور جادوگر بھی یہودی یا
عیسائی ہو سکتا ہے. جب یہ خواب آئے تو فوری اس کا اثر زائل
کرے۔(یاد رہے کہ خواب میں ویسے کتا دیکھنا جو نقصان نہیں پہنچا
رہا یہ جادو نہیں ہے)
خواب کا اثر زائل کرنے کا طریقہ جاننے کے لیے ویڈیو لنک پر کلک
کریں۔
 https://youtu.be/484R0tyhnqY 
(علاج) مرتبہ7سورة فاتحہ
 مرتبہ7آیت الکرسی
 مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ100 (86-85سورة یونس کی آیت نمبر (
 مرتبہ7سورة الفلق والناس
رقیہ دم صبح و شام ایک ایک مرتبہ سنیں جو اس لنک مینموجود ہے۔
 https://youtu.be/j3asGdKqOIk یہ پڑھائی ایک ماه صبح و شام پانی اور تیل پر دم کر کے پانی پینا ہے
اور تیل لگانا ہے۔
(اس کی تفصیل اس لنک میں دیکھیں)
 https://youtu.be/OQ_FvbBKfYo ۔ خواب میں بلی کو حملہ کرتے دیکھنا5
اگر انسان بلی کو خواب میں دیکھے کہ وه اسے نقصان پہنچانے کی
کوشش کر رہی ہے یا اسے نوچ رہی اور مارنے کی کوشش میں ہے تو
یہ شریر جادوگر اور شریر جنات کی علامت ہے اور قریبی حاسد کو
بھی ظاہر کرتی ہے۔ یہ حاسد عورت بھی ہو سکتی ہے جوآپ کے
قریبی رشتہ داروں میں سے ہے۔ یہاں ہمارا مقصد جادو کی علامت کی
نشاندہی کرنا ہے کہ جسے بھی ایسا خواب آئے اس پر جادو کی علامت 
ظاہر ہو چکی ہے جو کہ جنات کے ذریعے سے بھی ہو سکتا ہے۔( یاد
رہے کہ اگر بلی کو ویسے خواب میں دیکھا جائے جو کہ نقصان نہ
پہنچا رہی ہو تو یہ جادو کی علامت نہیں ہو گی۔)
اور جس کو یہ جادو کی علامت ہو وه اپنا علاج مندرجہ ذیل طریقہ
سے کرے۔
علاج مرتبہ7آیت الکرسی
 مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ7آخری دو قل
 مرتبہ)100 )اَللّٰھُمَّ اِنَّا نَجْعَلُکَ فِیْ نَحُوْرِھِمْ وَنَعُوْذُبِکَ مِنْ شَرُوْرِھِمْ
 مرتبہ)100 )لا حول ولا قوة الا با
 دن تک صبح و شام پانی پر دم کر کے پانی پینا ہے21یہ پڑھائی
یہ رقیہ دم صبح و شام ایک ایک مرتبہ سنیں
 https://youtu.be/j3asGdKqOIk اس عمل سے یہ مسئلہ ٹھیک ہو جائے گا ان شاء الله
(اس عمل کی تفصیل ہماری اس ویڈیو مینموجودہے)
 https://youtu.be/OQ_FvbBKfYo ۔خواب میں اپنے آپ کو اونچی جگہ سے گرتا ہوا دیکھنا6
خواب میں خود کو اونچی جگہ سے گرتے ہوئے دیکھنا مثلاً انسان
سیڑھیوں یا مکان یا کسی پہاڑ سے نیچے گر رہا ہے اور وه اس ڈر
سے بیدارہو جائے تو یہ جادو کی علامت ہے۔ یہ نقصان پہنچانے کا
جادو ہو سکتا ہے اور کامیاب انسان کو ناکام بنانے کا جادو بھی ہو سکتا
ہے۔ اکثر اوقات انسان اس جادو کے اثر سے سوتے ہوئے ڈر کر
بیدارہو جاتا ہے یا ایسے محسوس ہوتا ہے کہ کسی نے پکڑ کر اٹھا دیا
ہو اور جھٹکے بھی محسوس ہوتے ہیں۔
: طریقہ علاج مرتبہ7سورة فاتحہ
 مرتبہ7آیت الکرسی
 مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ7سورة المؤمنون کی آخری چار آیات
 مرتبہ7آخری تین قل
صبح و شام یہ پڑھائی کر کے پانی پر دم کرنا ہے اور پانی کو پی لینا
ہے۔
اور یہ رقیہ دم صبح اور شام ایک ایک مرتبہ سنیں۔
 https://youtu.be/j3asGdKqOIk یہ پڑھائی ایک ماه تک کریں ان شاء الله جادو کا اثر ختم ہو جائے گا۔
(اس عمل کی تفصیل ہماری اس ویڈیو مینموجودہے)
 https://youtu.be/9gJBtEKFTh4 ۔ خواب میں اُونچائی پر چڑھنے کی کوشش کرنا مگر چڑھ نہیں پانا۔7
اگر انسان خواب میں دیکھتا ہے کہ وه سیڑھیاں چڑھنے کی کوشش کر
رہا ہے یا بلندی کی طرف چڑھنے کی کوشش کر رہا ہے مگر چڑھ
نہیں پا رہا اور خود کو بے بس محسوس کر رہا ہے تو یہ بھی جادو کی
علامات میں سے ایک علامت ہے۔
اس کا شمار کامیابی سے روکنے والے جادو کی علامات میں ہوتا ہے۔
کسی بھی معاملے میں ناکام کرنے کے لئے اس قسم کا جادو کیا جاتا
ہے مثلاً پڑھائی سے روکنےکے لئے، رشتے کی بندش کے لئے یا
کاروبار میں ناکامی کے لئے اس قسم کا جادو کیا جاتا ہے اور مریض
کو ایسے خواب آتے ہیں۔
: طریقہ علاج مرتبہ7سورة فاتحہ
 مرتبہ)100سورة التوبہ کی آخری آیت (
 مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ100 (81سورة یونس کی آیت نمبر (
 مرتبہ7سورة الفلق و الناس
یہ پڑھائی صبح و شام پانی پر دم کر کے پی لے۔
اور یہ رقیہ دم صبح و شام ایک ایک مرتبہ سنیےجو اس لنک میں
موجودہے۔
 https://youtu.be/j3asGdKqOIk یہ پڑھائی ایک ماه کرنے سے جادو کا اثر زائل ہو جائے گا ان شاء الله
(تفصیل ہماری اس ویڈیولنک مینموجود ہے)
 https://youtu.be/FPL_bEhDBgg :۔خواب میں اپنے آپ کو کسی کام میں بے بس محسوس کرنا8
اکثر مریض خواب میں دیکھتے ہیں کہ کوئی کام جو وه باآسانی
سرانجام دے سکتے ہیں مگر خواب میں وه کر نہیں پا رہےہوتے۔ مثلاً
اگر کوئی خواب میں دیکھے کہ سارا پرچہ آتا ہے مگراس میں اسے
حل کرنے کی استطاعت نہیں ہے اور خود کو بے بس محسوس کر رہا
ہوتو ایسے خواب دیکھنا بھی جادو کی ایک قسم ہے اور یہ جادو بھی
کامیابی سے روکنے کے لئے کیا جاتا ہے۔ اس قسم کا جادو شادی میں
بندش، کامیابی میں رکاوٹ یا کاروبار میں بندش کے لیے کیا جاتا ہے۔
:طریقہ علاج مرتبہ100سورة التوبہ کی آخری آیت
 مرتبہ100لا حول ولا قوة الا با
 مرتبہ7سورة البقره کی آخری دو آیات
 مرتبہ100 (86-85سورة یونس کی آیت نمبر (
 مرتبہ7 قل 3آخری
یہ عمل صبح و شام پانی ہر دم کر کے ایک ماه تک پینا ہے۔ ان شاء الله
فائده ہو گا
اس کے ساتھ ساتھ یہ رقیہ دم صبح و شام ایک ایک مرتبہ سننا ہے
 https://youtu.be/j3asGdKqOI 
(اس کی تفصیل دیکھئے اس ویڈیو لنک میں)
 https://youtu.be/NNfHPwSOcI4 ۔خواب میں اپنے آپ کو بند راستوں میں پھنسے دیکھنا9
اکثر مریض خواب میں اپنے آپ کو بند گلیوں میں پھنسا ہوادیکھتے ہیں
اور کبھی دیکھتے ہیں کہ وه پانی میں پھنسے ہوئے ہیں۔کبھی کبھار ایسا
ہوتا ہے کہ وه کسی جگہ پر بے بس کھڑے ہوتے ہیں اور وہاں سے
نکلنے کا کوئی راستہ نہیں ہوتا۔ یہ سب کامیابی سے روکنے والے جادو
کی علامات ہیں اور جادوگر اس جادو کو تعویذ کے ذریعے سے کرتا
ہے اور اس جادو کا مریض اکثر سوتے ہوئے ڈر جاتا ہے۔
:علاج مرتبہ7سورة فاتحہ
 مرتبہ7آیت الکرسی
 مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ7سورة التوبہ کی آخری آیت
 مرتبہ7سورة الفلق والناس
 مرتبہ300استغفرالله
یہ پڑھائی صبح و شام پانی پر دم کر کے پانی پینا ہے
یہ رقیہ دم بھی صبح و شام ایک ایک مرتبہ سننا ہے۔
 https://youtu.be/j3asGdKqOIk ایک ماه تک یہ عمل کرنے سے جادو کا اثر ختم ہو جائے گا ان شاء الله
(اس کی تفصیل ہمارے اس لنک میں دیکھی جا سکتی ہے)
 https://youtu.be/PQ0FwAwf660 :خواب میں خود کو گندگی میں پھنسے دیکھنا .10
اگر انسان خود کو خواب کی حالت میں گندے پانی میں پھنسا دیکھے یا
وه اپنے آپ کو گندگی میں دیکھتاہے تو ایسے خواب کی مختلف تعبیریں
ہیں۔ مگر یہاں صرف وه خواب ذکر کریں گے جس کا تعلق جادو و
جنات سے ہے۔
اگر آپ خود کو گندے پانی یا کسی گندی جگہ پر پھنسا ہوادیکھتے ہیں
اور آپ اس سے نکل نہیں پا رہےاور بے بس ہینتو یہ جادو کی علامت
ہے۔ (نوٹ:اس کے علاوه کسی صورت میں گندگی کو خواب میں دیکھنا
جادو کی علامت نہیں ہے)
سب سے پہلے خواب کا اثر زائل کریں۔
(خواب کا اثر زائل کرنے کی تفصیل ہمارے اس لنک میں موجو دہے)
 https://youtu.be/484R0tyhnqY :علاج مرتبہ7سورة فاتحہ
 مرتبہ7آیت الکرسی
 ایک سومرتبہ98 تا 97سورة المؤمنون کی آیت نمبر 
 مرتبہ7سورة البقره کی آخری دو آیات
 مرتبہ7سورة الفلق والناس
 مرتبہ100اعوذ با من الشیطان الرجیم
 مرتبہ100لا حول ولا قوة الا با
یہ پڑھائی ایک ماه تک مسلسل کریں ان شاء الله جادو کا اثر ختم ہو
جائے گا۔
اور یہ رقیہ دم صبح و شام ایک ایک مرتبہ سنیں
 https://youtu.be/j3asGdKqOIk (اس کی تفصیل ہمارے اس ویڈیو لنک مینموجود ہے)
 https://youtu.be/433-5avDPT8 :۔ دم کے ذریعے جادو کی تشخیص11
ایک طریقہ خود کو چیک کرنے کا یہ بھی ہےکہ آپ ہمارا دم جو ہم
مریضوں کو چیک کرنے کے لئے کرتے ہیں وه یہاں ریکاڈنگ میں
موجود ہے اس کو تین بار سنیں اگر دم سنتے ہوئے سر یا کندھے
بھاری محسوس ہوں یا طبیعت خراب محسوس ہو تو دم کو بند کر دیں
اس کا مطلب آپ کو جادو وجنات کامسئلہ ہو سکتا ہے۔
اگر کچھ بھی محسوس نہ ہو تو آپ کو جادو و جنات کا مسئلہ نہیں ہے۔
(دم اس لنک میں موجود ہے)
 https://youtu.be/j3asGdKqOIk (اس کی تفصیل اس لنک میں دیکھیں
 https://youtu.be/sr7vKf3wjUo ۔ آپ پر یا آپ کے گھر پر خون کے چھینٹے گرنا12
گھر میں خون کے چھینٹے آنا یا گھر کی دیواروں، کونوں پر یا کاروبار
والی جگہ دکان وغیره کہیں بھی خون کے چھینٹے نظر آئیں یہ سب
جادو کی علامات میں سے ہیں۔
اس میں جادوگر پانی یا خون پر عمل کر کے پھینکتا ہے جو مریض
کے اٹھنے بیٹھنے والی جگہ پر خون کے چھینٹے بن کر گرتے ہیں۔
:علاججس جگہ پر بھی خون کے چھینٹے آتے ہوں اس جگہ کے چاروں (1(
کونوں میں سات سات مرتبہ اذانیں دینی ہیں ۔
 مرتبہ پڑھنی 7سورة البقره کی آخری دو آیات چاروں کونوں میں (2(
ہیں۔
 مرتبہ7سورة الفلق والناس چاروں کونوں میں پڑھنی ہیں۔ (3(
 مرتبہ استغفرالله کا ورد کرے۔700مریض سارے دن میں (4(
یہ رقیہ دم گھر میں صبح و شام ایک ایک مرتبہ سننا ہے۔
 https://youtu.be/j3asGdKqOIk یہ عمل ایک ماه تک کرنا ہے ان شاء الله جادو کا اثر ختم ہو جائے گا۔
(اس کی تفصیل ہماری اس ویڈیولنک میں موجود ہے)
 https://youtu.be/NCFZ5ghuK4Q 
:۔ گھر میں گوشت کا آنا13
یہ ایک جادو کی علامت ہے جو کہ اکثر جادوگر جنات کو بھیجنے کے
لئے گوشت والا عمل کرتے ہیں اور پھر اس کے ذریعے کسی کے گھر
پر یا کسی کے کاروبار پر جادو کیا جاتا ہے اور وہاں پر خون کے
چھینٹے یا گوشت آتا ہے۔ جب کبھی ایسا معاملہ ہو تو وہاں پر یہ عمل
کریں۔
:طریقہ علاججس جگہ پر گوشت آتا ہے وہاں پر سورة البقره کی تلاوت کی (1(
جائے یا ریکارڈنگ چلائی جائے۔
اس جگہ کے چاروں کونوں میں سات دن تک روزانہ ایک ایک (2(
مرتبہ اذان دی جائے۔
اوریہ عمل کرے مرتبہ7سورة البقره کی آخری دو آیات
 مرتبہ100 (98تا97سورة المؤمنون کی آیت نمبر(
 مرتبہ7سورة الفلق والناس
یہ پڑھائی صبح و شام پانی پر دم کر کے پانی پینا اور چھڑکنا ہے۔
ایک ماه تک یہ عمل کرنے سے جادو کا اثر ختم ہو جائے گا ان شاء الله
(یہ دم صبح و شام سنیں ۔دم اس ویڈیو لنک مینموجود ہے)
 https://youtu.be/j3asGdKqOIk (اس کی تفصیل ہماری اس ویڈیو لنک میں دی گئی ہے)
 https://youtu.be/NCFZ5ghuK4Q :۔ کپڑوں کا خود بخود کٹ جانا14
اکثر مریضوں کے ساتھ ایسا ہوتا ہے کہ ان کے کپڑوں کو کٹ لگ جاتا
ہے یا خود بخود پھٹ جاتے ہیں اور یہ عمل مسلسل ہوتا رہتا ہے۔یہ
عمل بھی جادو کی علامت ہے۔ جادوگر جنات کے ذریعے کپڑا کٹواتا
ہے اور اس کپڑے کے ذریعے انسان پر جادو کرتا ہے جس سے انسان
بیمار ہو جاتا ہے یا کسی پریشانی کا شکار ہو جاتا ہے۔
: علاجمرتبہ اذان دی جائے۔7، 7گھر کےچاروں کونوں میں
 مرتبہ7آیت الکرسی
 مرتبہ7سورة البقره کی آخری دو آیات
 مرتبہ7سورة الصافات کی پہلی دس آیات
 مرتبہ7سورةالفلق والناس
 مرتبہ300لا حول ولا قوة الا با
یہ پڑھائی صبح و شام پانی پر دم کر کے پانی پی لیں اور ایک ماه
مسلسل کرنے سے جادو کا اثر ختم کو جائے گا ان شاء الله
یہ رقیہ دم صبح و شام ایک ایک مرتبہ سننا ہے۔
 https://youtu.be/j3asGdKqOIk (اس کی تفصیل ہمارےاس ویڈیو لنک مینموجود ہے
 https://youtu.be/wDhyzVGItfc :۔بالوں کا درمیان سے کٹ جانا15
بالوں کا گرنا ایک الگ مسئلہ ہے مگر بالوں کا کٹ جانا یہ جادو کی
علامت ہے۔ اس قسم میں جادوگر مریض کے بال منگواتا ہے تاکہ اس
پرجادو کیا جا سکے۔ اگر مریض کے بال میسر نہ ہوں تو جادوگر خود
جنات کو بھیج کر جادو کے ذریعےبال منگوا لیتا ہے اور پھر ان بالوں
پر جادو کر تاہےجس سے عورت کو کسی سخت بیماری میں مبتلا کر
دیتاہے۔جس سے اکثر عورت کو پیٹ کی بیماری لگ سکتی ہے اور
مرد کو کوئی بھی بیماری کا جادو ہونے کا امکان ہے۔
:علاجسب سے پہلے صدقہ کرے۔
 مرتبہ7آیت الکرسی
 مرتبہ7سورة البقره آخری دو آیات
) مرتبہ(صبح و شام)33سورة الفلق والناس (
یہ پڑھائی صبح و شام کی جائے اور پانی پر دم کر کے پیئیناور ساتھ
میں رقیہ دم ایک بار سنا جائے تو جادو کا مسئلہ حل ہو جائے گا ان
شاء الله:رقیہ دم کا لنک مندرجہ ذیل ہے  https://youtu.be/j3asGdKqOIk 
(اس کی تفصیل اس ہمارے ویڈیو لنک مینموجود ہے)
 https://youtu.be/QmQXYegN7kk ۔گھر میں تعویز یا سوئیاں ملنا16
اگر گھر کے اندر سے تعویذ، انڈے، سوئیاں اور پتلے وغیره یا کوئی
بھی جادو والی چیز ملتی ہے تو یہ بھی جادو کی ایک علامت ہے۔ اگر
کوئی جادو والی چیز گھر سے ملے تو اس کو ہاتھ نہیں لگانا چاہیے
بلکہ باوضو ہوکر اذکار کر کے پھر کسی کپڑے کے ساتھ اس کو اٹھانا
 بار پڑھ کر کے اس جادو والی 7چاہیے اور پانی پر آخری سو سورتیں
چیز کو پانی میں ڈال دے۔ اس عمل سے اس کا جادو کا اثر ختم ہو
جائے گا اور ایسے جادو سے بچنے کے لئے یہ پڑھائی کرے۔
:علاج دن ایک ایک مرتبہ اذان دیں7گھر کے چاروں کونوں میں
 مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ7سورة المؤمنون کی اخری چار آیات
 مرتبہ7آخری تین قل
یہ پڑھائی مریض اپنے گھر میں صبح و شام کرے اور یہ رقیہ دم
:سنے  https://youtu.be/j3asGdKqOIk 
 دن دہرانے سے ان شاء الله جادو کا مسئلہ حل ہو جائے گا۔21یہ عمل
(اس کی تفصیل اس ویڈیو لنک مینموجود ہے)
 https://youtu.be/jaslLJE7SrM ۔گھر میں پانی کے چھینٹے پڑنا17
گھر میں پانی، خون یا پیلے رنگ کے چھینٹے آنا جادو کی علامت ہے۔
اس میں جادوگر جادو کرتے ہوئے پانی پر عمل کرتا ہے جس سے
مریض پریا اس کے گھرپر پانی یاخون کے چھینٹے بن کر گرتا ہے جو کہ بہت
ہی برا اثر رکھتا ہے۔ یہ جادوئی عمل جلد ہو جاتا ہے اور اس کا علاج
بھی با آسانی ہو جاتا ہے۔
:علاج مرتبہ اذان 7مریض گھر کے چاروں کونوں میں سے ہر کونے میں
دے ۔
مریض صبح و شام یہ پڑھائی کرے مرتبہ7سورة فاتحہ
 مرتبہ7آیت الکرسی
 مرتبہ100 (81سورة یونس (آیت نمبر
مرتبہ7، 7سورة الفلق و الناس
 مرتبہ100لا حول ولا قوة الا با
اور یہ رقیہ دم صبح و شام ایک ایک مرتبہ سنیں
 https://youtu.be/j3asGdKqOIk (اس کی تفصیل ہمارے اس ویڈیولنک مینموجودہے)
 https://youtu.be/f4L1i1woFj0 ۔ اسلام کے بارے میں کفریہ خیالات کا آنا18
یہ مسئلہ جنات کے غلبہ کی وجہ سے ہوتا ہے۔اس میں شیطان انسان پر
پورا غلبہ حاصل کر لیتا ہے اور انسان کو سست اور کاہل بنا دیتا ہے
کہ اس کو کفریہ خیالات آنے لگتے ہیں۔ انسان اذان اور تلاوت سے
کراہت محسوس کرنے لگ جاتا ہے جس کی وجہ سے برے خیالات
آتے ہیں اور انسان خودکشی تک کرنے کا سوچنے لگ جاتا ہے۔
یار رہے کہ اگر جادو کی باقی علامات میں سے کوئی علامت موجو د
نہیں ہے صرف یہی علامت ہے تو یہ نفسیاتی مسئلہ بھی ہو سکتا ہے
اگر مندرجہ بالا علامات میں سے کوئی علامت بھی موجود ہے تو یہ
شیطانی اثر کا مسئلہ ہے جو کہ اوپر بتادیا گیا ہے اوران دونوں مسائل
کا علاج بھی بتا دیا گیا ہے۔
:علاج مرتبہ100لا حول ولا قوة الا با
 مرتبہ100اعوذ با من الشیطان الرجیم
 ایک سو مرتبہ3اٰمَنْتُ بِاِ وَرَسُوْلِہ + سوره حدید کی آیت نمبر
 مرتبہ7آخری تین 
 ماه تک پانی پر دم کر کے پانی پی لے اور تیل پر دم کر 1یہ پڑھائی
کے تیل کو جسم پر لگا لے۔
اور ساتھ میں صبح و شام یہ رقیہ دم ایک ایک مرتبہ سننا ہے
 https://youtu.be/j3asGdKqOIk (اس کی تفصیل اس لنک میں دیکھی جا سکتی ہے)
 https://youtu.be/5coLiSAX3Mc ۔ یہ محسوس کرنا کہ کوئی آپ کو دیکھ رہا ہے یا ساتھ ہے19
اگر آپ ایسا کچھ محسوس کرتے ہیں کہ آپ کے پاس کوئی ہے یا کوئی
آپ کی نگرانی کر رہا ہے یا آپ کو آوازیں سنائی دیتی ہیں یا رات کو
طرح طرح کے وہم آتے ہے تو یہ شیطانی اثر کی علامت ہو سکتی ہیں۔
یار رہے کہ اگر جادو کی باقی علامات میں سے کوئی علامت موجو د
نہیں ہے صرف یہی ایک علامت ہے تو یہ نفسیاتی مسئلہ اور خوف کی
بیماری بھی ہو سکتی ہے اگر باقی علامات میں سے کوئی علامت بھی
موجود ہے تو یہ جادو و جنات کے اثر کا مسئلہ ہے جو کہ اوپر بتادیا
گیا ہے اوران دونوں مسائل کا علاج بھی بتا دیا گیا ہے۔
:علاج مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ7آخری دو قل 
 مرتبہ100لا حول ولا قوة الا با
 مرتبہ100 (98تا97سورة المؤمنون (آیت نمبر
 مرتبہ100استغفرالله
یہ پڑھائی صبح و شام پانی پر دم کر کے پانی کو پی لیں ۔
یہ رقیہ دم صبح و شام ایک ایک مرتبہ سنیں
https://youtu.be/j3asGdKqOIk
 ان شاء الله ہر قسم کے جادو جنات کا مسئلہ حل ہو جائے گا۔
(اس کی تفصیل اس لنک میں دیکھی جا سکتی ہے)
 https://youtu.be/xP6YlbIhNnw :۔ہمارا اس ایپ کو بنانے کا مقصد20
ہمارا مقصد یہ ہے کہ لوگ اپنا علاج خود کرنا سیکھیں۔اور جعلی
(دونمبر)عاملوں سے بچ جائیں۔
یادرکھیں اگر اوپر دی گئی علامات میں سے کوئی علامت آپ کے اندر
موجودنہیں ہے تو آپ کو جادو نہیں ہے ۔اس کے علاوه کوئی بھی
نفسیاتی مسئلہ یا بیماری ہو سکتی ہے`