export const jaddu=`
جادو سے حفاظت کے اذکار
:گھر سے نکلتے وقت کی دعا
بِسْمِ اللهِّٰ، تَوَكَّلْتُ عَلَى اللهِّٰ، لاَ حَوْلَ وَلاَ قُوَّةَ اِلاَّ بِاّٰ
الله کے نام کے ساتھ میں نے الله پر بھروسہ کیا اور الله
کی توفیق و مدد کے بغیر کسی گناه سے بچنے کی
طاقت اور کوئی نیکی کرنے کی قوت نہیں۔
 (3426 ،سنن ترمذی:5095سنن ابی داؤد:
گھر میں داخل ہوتے وقت کی دعا
بِسْمِ اللهِّٰ وَلَجْنَا، وَبِسْمِ اللهِّٰ خَرَجْنَا، وَعَلَى اللهِّٰ رَبَّنَا تَوَكَّلْنَا
الله کے نام کے ساتھ ہم داخل ہوئے اور الله کے نام کے
ساتھ ہی ہم باہر نکلے اور ہم نے اپنے پروردگار الله ہی
پر بھروسہ کیا۔
5096سنن ابی داؤد
واش روم میں داخل ہونے اور باہر نکلنے کی دعا (2(
:داخل ہونے کی دعا
اَللّٰھُمَّ اِنِّيْ أَعُوْذُ بِك مِنَ الْخُبُثِ وَالْخَبَائِثِ
اے الله میں خبیث جنوں اور خبیث جننیونسے تیری پناه
میں آتا ہوں۔
(142صحیح بخاری:)
:نکلنے کی دعا
غُفْرَانَكاے الله میں تیری پناه میں آتا ہوں۔
(7سنن ترمذی:)
صبح و شام کے اذکار +پانچوں نمازوں کی مکمل (3(
پابندیسورة البقرة کی آخری دو آیات (4(
آیۃ الکرسی (5(
 قل3آخری (6(
یہ عمل کرنے والے انسان پر کبھی جادو نہیں ہو سکتا۔
اس کی مزید تفصیل جانے کے لئے ہمارے یوٹیوب
چینل کی اس ویڈیو لنک کو دیکھیں
https://youtu.be/ZajCMrCUZaU`