export const karobari_masail_ka_jaddu=`
کاروباری مسائل کا جادو
کاروبار کے مسائل میں رکاوٹ میں ایک مسئلہ جو
جادو کے ذریعے سے کاروبار کی کامیابی میں رکاوٹ
ڈال دی جاتی ہے جس سے کاروبار متاثر ہوتا ہے اس
کے علاج کے لیے کچھ پڑھائی بتائی جا رہی ہے یہ
عمل کرنے سے ان شاء الله جادو کا مسئلہ حل ہو جائے
گا۔اگر دکان یا کوئی بھی کاروباری جگہ ہے وہاں ہر
 دن تک اذان پڑھیں7کونے میں ایک ایک مرتبہ
اور یہ پڑھائی کرے مرتبہ7سورة الفاتحہ
 مرتبہ7 آیات 2سورة البقره کی آخری
 مرتبہ7 (86تا85سورة یونس کی آیت نمبر(
 مرتبہ7 (69تا67سورة طٰہٰ کی آیت نمبر(
 مرتبہ7 قل 3آخری 
یہ پڑھائی دن میں دو مرتبہ(صبح وشام) پانی پر دم
کرکے پانی پیئیں مرتبہ (دن میں ایک مرتبہ)700استغفر الله
یہ رقیہ دم صبح و شام ایک ایک مرتبہ سننےجو
موجود ہے ہمارے یوٹیوب کے اس ویڈیو لنک میں
https://youtu.be/j3asGdKqOIkمزید تفصیل اس ویڈیو میں موجود ہےhttps://youtu.be/xcNqDkOaqs8`