export const khawand_bivi = `
خاوند بیوی کے مسائلخاوند بیوی کے درمیان جدائی ڈالنے والا جادو کیا گیا
ہوتو ان میں آپس میں لڑائی وغیره کا مسئلہ بن جاتا
ہےاور خاوند کو بیوی اچھی نہیں لگتی اوربیوی کو
خاوند اچھا نہیں لگتا۔ دونوں کو اکثر ایک دوسرے کی
صورت اچھی نظر نہیں آتی ۔ایک دوسرے سے بدبو کا
آنا اور اس طرح کے بہت سے مسائل پیدا ہوجاتےہیں۔
ان کے علاج کیلئے یہ پڑھائی کی جائےخاوند بیوی دونوں ہی یا ان میں سے کو ئی ایک یہ
پڑھائی کرے تو ان شاء الله فائده ہو گا۔
 مرتبہ7سورةالفاتحہ
 مرتبہ7آیۃ الکرسی
 مرتبہ7 ، 102سورة البقره کی آیت نمبر
 مرتبہ7سورة البقره کی آخری دو آیات
 مرتبہ7 قل 3آخری
 مرتبہ700استغفر الله 
یہ پڑھائی پانی پر دم کر کے پانی پیا جائے۔
یہ عمل ایک ماه کریں ان شاء الله مسئلہ بہتر ہو جائے
گااس کے ساتھ یہ رقیہ دم سنیں جو اس یوٹیوب چینل کے
ویڈیو لنک میں موجودہےhttps://youtu.be/j3asGdKqOIkاس مسئلے کے حوالہ سے مزید تفصیل جانئے ہمارے
یوٹیوب چینل کی ویڈیومیں
https://youtu.be/cq6IfjmEuxA`