export const masnon_dua = `
:والدین کے لیے دعائیں
:بچوں کو علم و حکمت کی دعا دینا
اَللّٰھُمَّ عَلِّمْھُ الْکِتَابَ
اے الله !اسے کتاب (قرآن)کی تعلیم دے۔(صحیح بخاری)ٰ
اَللّٰھُمَّ عَلِّمْھُ الْحِکْمَة
)3756اے الله اسے حکمت (سنت) سکھا۔(صحیح بخاری:
اَللّٰھُمَّ فَقِھْھُ فِیْ الدِّیْنِ وَعَلِّمْھُ التَّأْوِیْل
َاے الله! اسے دین کی سمجھ عطا فرما اور کتاب کی تاویل و
تفسیر سکھا۔
(2397مسند احمد:)
:اولاد کے رزق میں برکت کی دعا
اَللّٰھُمَّ أَکْثِرْ مَالَھُ وَوَلَدَهُ وَبَارِکْ لَھُ فِیْمَا أَعْطَیْتَھ
ُاے الله! اس کے مال و اولاد کو زیاده کر اور جو کچھ تو
نے اسے دیا ہے، اس میں اسے برکت عطا فرما۔
: نے فرمایا:جب تم کہو گے رسول الله
اللّٰھُمَّ اررْزُقْنِیْ
اے الله مجھے رزق دے۔
تو الله تعالیٰ کہے گا :میں نے رزق دینے کا فیصلہ کر
)3336دیا۔(سلسلہ احادیث صحیحہ:
 کے پاس آیا اس نے کہا :اے الله ایک آدمی رسول الله
کے رسول ! جب میں اپنے رب سے دعا کروں تو کیا کہا
کروں؟: نے فرمایا :کہو تو آپ
اَللّٰھُمَّ اغْفِرْلِیْ وَارْحَمْنِیْ وَعَافِنِیْ وَارْزُقْنِیْ
اے الله مجھے معاف فرما، مجھ پر رحم فرما ،مجھے عافیت
دے اور مجھے رزق عطا فرما ۔
اس کے بعد آپ نے انگوٹھے کو نکال کر باقی چار انگلیوں
:کو بند کر کے فرمایا
یہ چیزیں تمہاری دنیا و آخرت کو جمع کرنے والی ہیں۔
(6851صحیح مسلم:)
:گھریلوپریشانیوں پر صبر کرنا اورالله سے مدد مانگنا
اللهُ الْمُسْتَعَانُ اَللّٰھُمَّ صَبْرًا وَعَلَی اللهِ التُّکْلاَنُ
الله ہی مددگار ہے، اے الله! صبر عطا فرما اور الله پر ہی
توکل ہے۔
(19644مسند احمد :)
:حلال اور طیب رزق کی دعا مانگنا
اَللّٰھُمَّ اِنِّیْ أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَیِّبًا وَعَمَلاً مُتَقَبَّلاً
اے الله! بے شک میں تجھ سے نفع بخش علم، طیب رزق
اور قبولیت والے عمل کا سوال کرتا ہوں۔
(925سنن ابن ماجہ:)
اَللّٰھُمَّ اکْفِنِیْ بِحَلاَلِكَ عَنْ حَرَامِكَ وَأَغْنِنِیْ بِفَضْلِكِ عَمَّنْ سِوَاك
َاے الله! اپنے حلال کے ذریعے حرام سے میری کفایت فرما
اور اپنی مہربانی سے مجھے اپنے علاوه ہر ایک سے بے
نیاز فرما دے۔
(3563جامع ترمذی:)
:ضرورت میں برکت کی دعا
اَللّٰھُمَّ اغْفِرْلِیْ ذَنْبِیْ، وَوَسِّعْ لِیْ فِیْ دَارِیْ، وَبَارِکْ لِیْ فِیْ رِزْقِیْ
اے الله! میرے لیے میرے گناه معاف کر دے، میرے لیے
میرے گھر میں وسعت پیدا کردے اور میرے لیے میرے
رزق میں برکت دے(1265صحیح الجامع الصغیر:)
:صاح اور مد میں برکت کی دعا
اَللّٰھُمَّ بَارِکْ لَنَا فِیْ صَاعِنَا وَمُدِّنَا وَاجْعَلْ مَعَ الْبَرَكَةِ بَرَكَتَیْنِ
اے الله! ہمارے لیے ہمارے صاع میں اور ہمارے مد میں
برکت عطا فرما اور ایک برکت کے ساتھ دو برکتیں کر
دے۔
(3337صحیح مسلم:)
:؎پھلوں میں برکت کی دعا
سیدنا ابو ہریره کہتے ہیں کہ جب لوگ پہلا پھل دیتے تو
 کی طرف لے آتے جب رسول الله اسے رسول الله
:اسے پکڑتے تو دعا فرماتےاَللّٰھُمَّ بَارِکْ لَنَا فِیْ ثَمَرِنَا وَبَارِکْ لَنا فِیْ مَدِیْنَتِنَا وَبَارِکْ لَنَا فِیْ
صَاعِنَا وَبَارِکْ لَنَا فِیْ مُدِّنَا
اے الله! ہمارے لیے ہمارے پھلوں میں برکت عطا فرما اور
ہمارے لیے ہمارے مدینہ میں برکت عطا فرما اور ہمارے 
لیے ہمارے صاع میں برکت عطا فرما اور ہمارے لیے
ہمارے مد میں برکت عطا فرما۔
(3334صحیح مسلم:)
:زمین کے پھل پانے کی دعا
اَللّٰھُمَّ ارْزُقْنَا مِنْ ثَمَرَاتِ الاَْرْضِ وَبَارِکْ لَنَا فِیْ مُدِّنَا وَصَاعِنَا
اے الله! ہمیں زمین کے پھلوں کا رزق دے اور ہمارے لیے
ہمارے مد اور ہمارے صاع میں برکت عطا فرما۔
(14690مسنداحمد :)
گھریلوپریشانیوں سے نجات کی دعائیں
:پریشانیوں میں پڑھنےکی دعا
 نے سیدنا اسماء بنت عمیس بیان کرتی ہیں کہ رسول الله
مجھ کسے کہا:کیا میں تمہیں ایسے کلمات نہ سکھاؤں جن
کو تم پریشانی کےوقت پڑھا کرو؟
اللهُ اللهُ رَبِّیْ لاَ أُشْرِكُ بِھِ شَیْئًا
الله ہی، الله ہی میرا رب ہے، میں اس کے ساتھ کسی چیز کو
شریک نہیں بناتی۔
(1525سنن ابی داؤد:)
:گھریلو کام کاج کی تھکاوٹ کا علاج
سیدنا علی رضی الله عنہ بیان کرتے ہیں کہ حضرت فاطمہ
رضی الله عنہ کو چکی پیسنے کی بہت تکلیف ہوتی ۔ پھر
انہیں معلوم ہوا کہ رسو ل الله صلی الله علیہ وسلم کے پاس
کچھ قیدی آئے ہیں ۔ اس لئے وه بھی ان میں سے ایک
لونڈی یا غلام کی درخوست لے کر حاضر ہوئیں ۔ لیکن
آنحضرت صلی الله علیہ وسلم موجود نہیں تھے ۔ وه سیده
عائشہ رضی الله عنہ سے اس کے متعلق کہہ کر ( واپس )
چلی آئیں ۔ پھر جب رسول الله صلی الله علیہ وسلم تشریف
لائے تو سیده عائشہ رضی الله عنہ نے آپ صلی الله علیہ
وسلم کے سامنے ان کی درخوست پیش کردی ۔
سیدنا علی رضی الله عنہ کہتے ہیں کہ اسے سن کر رسول
الله صلی الله علیہ وسلم ہمارے یہاں ( رات ہی کو ) تشریف
لائے ۔ جب ہم اپنے بستروں پر لیٹ چکے تھے ( جب ہم
نے رسول الله صلی الله علیہ وسلم کو دیکھا ( تو ہم لوگ
کھڑے ہونے لگے تو آپ صلی الله علیہ وسلم نے فرمایا کہ
جس طرح ہو ویسے ہی لیٹے رہو ۔ ( پھر آپ صلی الله علیہ
وسلم میرے اور فاطمہ رضی الله عنہ کے بیچ میں بیٹھ گئے
اوراتنے قریب ہو گئے کہ ) میں نے آپ کے دونوں قدموں
کی ٹھنڈک اپنے سینے پر پائی ۔ اس کے بعد آپ صلی الله
علیہ وسلم نے فرمایا ’ جو کچھ تم لوگوں نے ( لونڈی یا
غلام ) مانگے ہیں ’ میں تمہیں اس سے بہتر بات کیوں نہ 
بتاؤں ’ جب تم دونوں اپنے بستر پر لیٹ جاؤ ( تو سونے
( سے پہلے مرتبہ۴٣الله اکبر
 مرتبہ٣٣اور الحمدالله
مرتبہ٣٣اور سبحان الله
پڑھ لیا کرو یہ عمل بہتر ہے اس سے جو تم دونوں نے
مانگا ہے ۔
(3113صحیح بخاری:)
:مکان کی تنگی دور کرنےکی دعا
اَللّٰھُمَّ اغْفِرْلِیْ ذَنْبِیْ، وَوَسِّعْ لِیْ فِیْ دَارِیْ، وَبَارِکْ لِیْ فِیْ
رِزْقِیْ اے الله! میرے لیے میرے گناه معاف کر دے، میرے لیے
میرے گھر میں وسعت پیدا کر دے اور میرے لیے میرے
رزق میں برکت دے۔
(1265صحیح الجامع الصغیر:)
:گھریلو معاملات کی اصلاح کی دعا
اَللّٰھُمَّ أَصْلِحْ لِیْ دِیْنِیَ الَّذِیْ ھُوَ عِصْمَةُ أَمْرِیْ وَأَصْلِحْ لِیْ دُنْیَایَ
الَّتِیْ فِیْھَا مَعَاشِیْ وَأَصْلِحْ لِیْ آخِرَتِیْ الَّتِیْ فِیْھَا مَعَادِیْ وَاجْعَلِ
الْحَیَاةَ زِیَادَةً لِیْ فِیْ كُلِّ خَیْرٍ وَاجْعَلِ الْمَوْتَ رَاحَةً لِیْ مِنْ كُلِّ
شَرٍّاے الله! میرے لیے میرے دین کو درست فرما جو میرے
معاملات کا محافظ ہے اور میرے لیے میری دنیا کو درست
فرما جس میں میرا معاش ہے اور میرے لیے میری آخرت
کو درست فرما جس میں میرا لوٹنا ہے اور زندگی کو ہر
بھلائی میں میرے لیے زیاد تی کا باعث بنا دے اور موت
کو میرے لیے ہر شر سے راحت بنا دے۔
(6903صحیح مسلم:)
:آپس میں محبت پیدا کرنے کی دعا
اَللّٰھُمَّ أَلِّفْ بَیْنَ قُلُوْبِنَا، وَأَصْلِحْ ذَاتَ بَیْنِنَا، وَاھْدِنَا سُبُلَ السَّلاَمِ،
وَنَجِّنَا مِنَ الظُّلُمَاتِ اِلَی النُّوْرِ، وَجَنِّبْنَا الْفَوَاحِشَ مَا ظَھَرَ مِنْھَا
وَمَا بَطَنَ، وَبَارِکْ لَنَا فِیْ أَسْمَاعِنَا وَأَبْصَارِنَا وَقُلُوْبِنَا وَأَزْوَاجِنَا
وَذُرِّیَّاتِنَا، وَتُبْ عَلَیْنَا اِنَّكَ أَنْتَ التَّوَّابُ الرَّحِیْمُ، وَاجْعَلْنَا شَاكِرِیْنَ
لِنِعْمَتِكَ مُثْنِیْنَ بِھَا قَابِلِیْھَا وَأَتِمَّھَا عَلَیْنَا
اے الله! ہمارے دلوں میں الفت پیدا فرما دے اور ہمارے
آپس کے معاملات کی اصلاح کر دے اور سلامتی کے
راستوں کی طرف ہماری راه نمائی فرما اور ہمیں اندھیروں 
سے نجات دے کر نور کی طرف لے آ۔ اور ہمیں تمام
ظاہری اور چھپی بدکاریوں سے محفوظ رکھ۔ اورہمارے
لیے ہمارے کانوں اور ہماری آنکھوں اور ہمارے دلوں اور
ہمارے زوج، اور ہمارے بچوں میں برکتیں عطا فرما اور
ہماری توبہ قبول فرما بلاشبہ تو بہت زیاده توبہ قبول کرنے
والا رحم کرنے والا ہے اور ہمیں اپنی نعمتوں کا شکر
کرنے والا بنا دے اور ان کی تعریف کرنے والا ان کو قبول
کرنے والا بنا دے اور ان (نعمتوں) کو ہم پر کامل فرما دے
(969ابو داؤد:)
:اپنی زبان اور دل کی درستگی کی دعا
اَللّٰھُمَّ عَافِنِیْ مِنْ شَرِّ سَمْعِیْ وَبَصَرِیْ وَلِسَانِیْ وَقَلْبِیْ وَمِنْ شَرِّ
مَنِیِّیْ
اے الله! مجھے میرے کانوں، آنکھوں، زبان، دل اور ماده
منویہ کے شر سے محفوظ رکھ۔
(5486سنن النسائی:)
شدید جنات کے حملے سے بچانے والی دعا
أَعُوْذُ بِوَجْھِ اللهِ الْعَظِیْمِ الَّذِیْ لَیْسَ شَیْئٌ أَعْظَمَ مِنْھُ وَبِكَلِمَاتِ اللهِ
التَّامَّاتِ الَّتِیْ لاَ یُجَاوِزُھُنَّ بَرّ وَلاَ فَاجِرٌ وَبِأَسْمَاءِ اللهِ الْحُسْنٰی
كُلِّھَا مَا عَلِمْتُ مِنْھَا وَمَا لَمْ أَعْلَمْ مِنْ شَرِّ مَا خَلَقَ وَبَرَأَ وَذَرَأَ
میں الله کے چہرے کی پناه لیتا ہوں جس سے عظیم کوئی
اور چیز نہیں ہے ۔ اور اس کے مکمل کلمات کے ساتھ پناه
لیتا ہوں جن سے کوئی نیک اور بد آگے نہیں بڑھ سکتا اور
اس الله کے تمام اسمائے حسنی کے ساتھ پناه لیتا
ہونجنہینمیں جانتا ہوں اور جنہیں میں نہیں جانتا اس چیز
کے شر سے جسے اس نے بنایا،پیدا کیا اور پھیلایا ۔
(12الموطا امام مالک:)
:اپنا ہاتھ دردوالی جگہ پر رکھ کر یہ دعا پڑھنا
بار) أَعُوْذُ بِاِ وَقُدْرَتِھِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ 3بِسْمِ اللهِ(
بار)7)الله کے نام کے ساتھ ۔ میں الله اور اس کی قدرت کی پناه لیتا
ہوں، اس چیز کے شر سے جسے میں پاتا ہوں اور جس
سے میں ڈرتا ہوں(5737صحیح مسلم:)
نظر بد اور حاسد سے حفاظت کی دعائیں
:نظر بد سے حفاظت کی دعائی
کسی چیز کو دیکھ کر یہ کہنا
مَا شَاءَ اللهُ لاَ قُوَّةَ اِلاَّ بِاجو الله نے چاہا کچھ قوت نہیں مگر الله کی مدد سے۔
(39سورة الکھف:)
:پسندیده چیز کو دیکھ کر برکت کی دعا دینا
بَارَكَ اللهُ فِیْہالله تمھیں اس میں برکت دے نے فرمایا:جب تم میں سے کوئی اپنے بھائی یا رسول الله
اس کے مال میں ایسی چیز دیکھے جو اسے پسند آئے تو
اسے چاہیے کہ وه اسے برکت کی دعا دے کیونکہ نظر کا
لگنا برحق ہے۔
(15700مسند احمد :)
:الله کے مکمل کلمات کےذریعے پناه لینا
أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَیْطَانٍ وَھَامَّةٍ وَمِنْ كُلِّ عَیْنٍ
لاَمَّةمیں پناه لیتا ہوں الله کے مکمل کلمات کے ذریعے ہر ایک
شیطان سے اور ہر زہریلے جانور سے اور ہر نقصان
پہنچانے والی نظر بد سے
(3371صحیح بخاری:)
:نظر بد سے حفاظت کا دم
 پر نظر سے حفاظت سیده عائشہ کہتی ہیں کہ رسول الله
کے لئے دم کرتی تھی میں اپنا ہاتھ ان کے سینے پر رکھتی
:اور کہتیاِمْسَحِ الْبَأْسَ رَبَّ النَّاسِ بِیَدِكَ الشِّفَائُ لاَ كَاشِفَ لَھُ اِلاَّ أَنْتَ
اے لوگوں کے رب! اس تکلیف کو دور فرما، شفا تیرے ہاتھ
میں ہے، تیرے علاوه اسے کوئی دور نہیں کرسکتا
(24995مسند احمد :)
:صبح و شام تین تین مرتبہ یہ دعا پڑھنا
بِسْمِ اللهِ الَّذِیْ لاَ یَضُرُّ مَعَ اسْمِھِ شَیْئ فِی الأَْرْضِ وَلاَ فِیْ السَّمَاءِ
وَھُوَ السَّمِیْعُ الْعَلِیْم
الله کے نام سے، وه ذات کہ اس کے نام سے کوئی چیز
زمین میں ہو یا آسمان میں، نقصان نہیں دے سکتی اور وه
خوب سننے والا خوب جاننے والا ہے۔
:ہر نقصان سے بچنے کی دعا
اعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ
میں الله کے کامل کلمات کی پناه لیتاہوں ہر اس چیز کے شر
سے جو اس نے پیدا کی ہےجبریل علیہ السلام کادم
بِسْمِ اللهِ أَرْقِیْكَ مِنْ كُلِّ شَیْئٍ یُؤْذِیْكَ مِنْ حَسَدِ حَاسِدٍ وَكُلِّ عَیْنٍ
وَاسْمُ اللهِ یَشْفِیْكَ
الله کے نام کے ساتھ میں آپ کو دم کرتا ہوں ہر اس چیز
سے جو آپ کو اذیت دیتی ہے ، ہر حاسد کے حسد سے اور
ہر نظر بد سے، اور الله کے نام کے ساتھ ، (الله )آپ کو شفا
دے(22760مسند احمد:)
رَبِّ أَعُوْذُ بِكَ مِنْ ھَمَزٰتِ الشَّیٰطِیْنِ۝ وَأَعُوْذُبِكَ رَبِّ أَنْ
یَّحْضُرُوْنِ۝اے میرے رب!میں شیطان کی اکساہٹوں سے تیری پناه
لیتاہوں اوراے میرے رب اس بات سے بھی تیری پناه
لیتاہوں کہ وه میرے پاس آئیں
أَنِّیْ مَسَّنِیَ الشَّیْطٰنُ بِنُصْبٍ وَّعَذَابٍ ۝
بے شک شیطان نے مجھے سخت تکلیف اور عذاب میں ڈال
دیا ہےوَاِمَّا یَنْزَغَنَّكَ مِنَ الشَّیْطٰنِ نَزْغ فَاسْتَعِذْ بِاِ اِنَّھُ سَمِیْعٌ عَلِیْمٌ۝اور اگر کبھی شیطان آپ کو اکسائے تو الله سے پناه مانگیے
بے شک وه سب کچھ سننے اور جاننے والا ہے
أَعُوْذُ بِاِ مِنَ الشَّیْطٰنِ الرَّجِیْمِ مِنْ ھَمْزِهِ وَنَفْخِھِ وَنَفْثِھ
ِمیں الله کی پناه لیتاہوں کہ شیطان مردود مجھ پر کوئی جنون
کا اثر ڈالے یا مجھے تکبر پر آماده کرے یا غلط شعر و
شاعری کی طرف لےآئ`