export const nazar_band_ka_ilaj = `نظر بد کا علاج:علاماترنگت کا بدل جانا(1(
اچانک کسی کام کا اُلٹا ہو جانا (2(
چہر ے پر سیاه یا سرخ دبے پڑھ جانا (3(
خواب میں خود کو گرتے دیکھنا (4(
علامات اور علاج کی تفصیل ہمارے یوٹیوب چینل قرآن
سےروحانی علاج کے اس لنک کی ویڈیو میں دی گئی ہے
وه دیکھیںhttps://youtu.be/A7WTnigAB1oنظربد کا علاج اس ویڈیو لنک میں بھی موجود ہے
https://youtu.be/A9lNdFBWHwI:پہلا طریقہ علاجاگر پتا چل جائے کہ نظر کس کی لگی ہے تو اس کے غسل
کا پانی لیا جائے اوراس سے غسل کے پانی سے وه غسل 
کرے جس کو نظر لگی ہے ۔یہ کام کرنے سے ان شاءالله
نظر بد کا اثر ختم ہو جائے گا جیسا کہ درجہ ذیل حدیث میں
ہے: فرماتے ہیں نبی اکرم
اگر کوئی چیز تقدیر پر سبقت(پہل) کر سکتی تو اس پر “.لَوْ كَانَ شَيْءٌ سَابَقَ القَدَرَ لَسَبَقَتْھُ العَیْنُ، وَإِذَا اسْتُغْسِلْتُمْ فَاغْسِلُوا
نظر بد ضرور سبقت کرتی۔ اور جب لوگ تم سے غسل
کرائیں تو تم غسل کر لو۔
(2062جامع ترمذی:)
ایک دوسری روایت میں ہےعامر بن ربیعہ رضی الله عنہ سہل بن حنیف رضی الله عنہ
کے پاس سے گزرے، جب کہ وه غسل کر رہے تھے اتفاق
سے انہوں نے سہل بن حنیف رضی الله عنہ کو دیکھ کر
بے ساختہ کہا کہ: میں نے آج تک کسی کنواری دو شیزه
کی بھی اس طرح کی جلد نہیں دیکھی۔یہ کہنا تھا کہ سہل
بے ہوش ہو کر زمین پر گر پڑے۔ انہیں رسول الله صلی الله
علیہ وسلم کی خدمت میں لے جایا گیا اور عرض کیا گیا:
سہل بے ہوش ہو کر گر گئے ہیں۔ آپ نے فرمایا: تم ان کے
بارے میں کس کو مورد الزام ٹھہراتے ہو؟ صحابہ کرام 
رضی الله عنہم نے عرض کیا: عامر بن ربیعہ کو۔ نبی اکرم
:صلی الله علیہ وسلم نے فرمایا
عَلاَمَ یَقْتُلُ أَحَدُكُمْ أَخَاهُ، إِذَا رَأَى أَحَدُكُمْ مِنْ أَخِیھِ مَا یُعْجِبُھُ، »
«فَلْیَدْعُ لَھُ بِالْبَرَكَةِ
(3509سنن ابن ماجہ:
تم میں سے کوئی اپنے بھائی کو قتل کرنے کے درپے “
کیوں ہے؟ تم میں سے کوئی جب اپنے بھائی کی کوئی
خوش کن بات دیکھے تو اس کے لیے برکت کی دعا کرے۔
پھر آپ صل الله علیہ وسلم نے پانی منگوایا اور عامر رضی
الله عنہ کو حکم دیا کہ وه وضو کریں، تو انہوں نے اپنے
چہرے اور دونوں ہاتھوں کو کہنیوں تک دھویا، دونوں
گھٹنوں اور ازار کے اندر کے حصے کو دھویا اور پھر آپ
”نے حکم دیا کہ وه پانی نظر لگے ہوئے شخص پر بہا دیں۔
:دوسرا طریقہ علاج مرتبہ7سورة الفاتحہ (1(
    مرتبہ7 آیات 2سورة البقره کی آخری (2(
    آیات4سورة المؤمنون کی آخری (3(
    مرتبہ7مندرجہ ذیل میں لکھی گئی دعا (4(
أَعِیْذُکَمَا بِکَلِمَاتِ اللهِّٰ التَّامَّةِ مِنْ کُلِّ شَیْطَانٍ وَّھَامَّةٍ وَمِنْ کُلِّ »
«عَیْنٍ لاَمَّةٍ
(3371صحیح بخاری:
    قل3آخری (5(
یہ پڑھائی پانی اور تیل پر دم کریں پانی کو پیا جائے اور
تیل جسم پر لگا کر نہا لیں۔
:نظر بد سے حفاظتسیدنا عبدالله بن عباس رضی الله عنہ بیان کرتے ہیں کہ نبی
کریم صلی الله علیہ وسلم حسن و حسین رضی الله عنہا کے
لئے پناه طلب کیا کرتے تھے اور فرماتے تھے کہ تمہارے
بزرگ دادا ( ابراہیم علیہ السلام ) بھی ان کلمات کے ذریعہ
الله کی پناه اسماعیل اوراسحاق علیہا السلام کے لئے مانگا
کرتے تھےأَعُوذُ بِكَلِمَاتِ اللهَِّ التَّامَّةِ، مِنْ كُلِّ شَیْطَانٍ وَھَامَّةٍ، وَمِنْ كُلِّ عَیْنٍ
لاَمَّةٍ
میں پناه مانگتا ہوں الله کے پورے پورے کلمات کے ذریعہ
ہر ایک شیطان سے اور ہر زہریلے جانور سے اور
ہرنقصان پہنچانے والی نظر بد سے ۔
(3371صحیح بخاری: )
سیده عائشہ رضی الله عنہا کہتی ہیں کہ رسول الله صلی الله
علیہ وسلم نے مجھے حکم دیا کہ نظر بد لگ جانے پر
معوذتین سے دم کرلیا جائے ۔
(5738صحیح بخاری:)
عبدالله بن عباس رضی الله عنہ نے نبی کریم صلی الله علیہ
وسلم سے روایت کی کہ آ پ نے فرمایا:نظر حق(ثابت شده
بات) ہے ،اگر کوئی ایسی چیز ہوتی جو تقدیر پر سبقت لے
جاسکتی تو نظرسبقت ہے جاتی۔اور جب(نظر بد کے علاج
کےلیے) تم سے غسل کرنے کے لئے کہا جائے تو غسل
کرلو۔
5702صحیح مسلم:
سیده عائشہ رضی الله تعالیٰ عنہا سے روایت کی ،کہا:
رسول الله صلی الله علیہ وسلم مجھے حکم دیتے تھے کہ وه
نظر بد سے دم کرالوں ۔
(5722صحیح مسلم:)
ابوسعیدخدری رضی الله عنہ کہتے ہیں: رسول الله صلی الله
علیہ وسلم جنوں اورانسان کی نظربدسے پناه مانگاکرتے
تھے ، یہاں تک کہ معوذتین (سورة الفلق اورسورة
الناس)نازل ہوئیں ، جب یہ سورتیں اترگئیں تو آ پ نے ان
دونوں کو لے لیا اور ان کے علاوه کو چھوڑدیا
(2058جامع ترمذی:)
سیدنا ابوہریره رضی الله عنہ کہتے ہیں کہ رسول الله صلی
الله علیہ وسلم نے فرمایا “ نظر لگ جانا حق ہے
(3879سنن ابی داؤد: )`