export const quran_duayen = `
قرآنی دعائیں:علم کے اضافہ کیلئے دعا
رَبِّ اشْرَحْ لِيْ صَدْرِيْ۝وَیَسِّرْ لِيْٓ اَمْرِيْ۝وَاحْلُلْ عُقْدَةً مِّنْ
لِّسَانِيْ۝یَفْقَـــہُوْا قَوْلِيْ۝وَاجْعَلْ لِّيْ وَزِیْرًا مِّنْ
اَہْلِيْ۝یَفْقَـــہُوْا قَوْلِيْ۝اے میرے رب ! میرے لیے میرا سینہ کھول دے۔اور میرے
لیے میرا کام آسان کر دے۔اور میری زبان کی کچھ گره
کھول دے۔کہ وه میری بات سمجھ لیں۔
(29تا 25سورة طٰہٰ:)
: علم و حکمت کیلئے دعا
رَبِّ ہَبْ لِيْ حُكْمًا وَّاَلْـحِقْنِيْ بِالصّٰلِحِیْنَ۝وَاجْعَلْ لِّيْ لِسَانَ
صِدْقٍ فِي الاْٰخِرِیْنَ۝وَاجْعَلْنِيْ مِنْ وَّرَثَۃِ جَنَّۃِ النَّعِیْمِ۝وَاغْفِرْ
لاَِبِيْٓ اِنَّہٗ كَانَ مِنَ الضَّاۗلِّیْنَ۝وَلاَ تُخْزِنِيْ یَوْمَ یُبْعَثُوْنَ۝اے میرے رب ! مجھے حکم عطا کر اور مجھے نیک
لوگوں کے ساتھ ملا۔اور پیچھے آنے والوں میں میرے لیے
سچی ناموری رکھ۔اور مجھے نعمت کی جنت کے وارثوں
میں سے بنا۔اور میرے باپ کو بخش دے، یقینا وه گمراہوں
میں سے تھا۔اور مجھے رسوا نہ کر، جس دن لوگ اٹھائے
)87تا83)سورة الشعراء :آیت نمبر جائیں گے۔
:والدین پر رحمت کی دعا
رَبِّ ارْحَمْھُمَا کَمَا رَبَّیٰنِیْ صَغِیْرًا۝اے میرے رب! ان دونوں پر رحم کر جیسے انھوں نے
بچپن میں مجھے پالا۔
(24بنی اسرائیل:)
:والدین کے لئے مغفرت کی دعا
رَبَّنَا اغْفِرْلِیْ وَلِوَالِدَیَّ وَلِلْمُؤْمِنِیْنَ یَوْمَ یَقُوْمُ الْحِسَابُ۝اے ہمارے رب! مجھے بخش دے اور میرے ماں باپ کو
اور ایمان والوں کو، جس دن حساب قائم ہوگا۔
(41سورة ابراھیم:)
:والدین پر الله کی نعمتوں کا شکر ادا کرنے کی دعا
رَبِّ اَوْزِعْنِيْٓ اَنْ اَشْكُرَ نِعْمَتَكَ الَّتِيْٓ اَنْعَمْتَ عَلَيَّ وَعَلٰي وَالِدَيَّ
وَاَنْ اَعْمَلَ صَالِحًا تَرْضٰىہُ وَاَدْخِلْنِيْ بِرَحْمَتِكَ فِيْ عِبَادِكَ
الصّٰلِحِیْنَ۝اے میرے رب! مجھے توفیق دے کہ میں تیری اس نعمت
کا شکر ادا کرسکوں جو تو نے مجھے اور میرے والدین
کو عطا کی ہے اور اس بات کی بھی کہ میں ایسے اچھے 
عمل کروں جو تجھے پسند ہوں اور اپنی رحمت سے
مجھے اپنے صالح(نیک) بندوں میں داخل کر۔(سورة
)19النمل:
:اولاد کے لیے دعائیںنیک اولاد کے حصول کیلئے دعائیں
:1دعا نمبر
رَبِّ ہَبْ لِيْ مِنَ الصّٰلِحِیْنَ۝اے میرے رب! مجھے صالح (نیک)اولادعطا فرما۔
(100سورة الصٰفٰت:)
:2دعا نمبر
رَبِّ لاَ تَذَرْنِیْ فَرْدًا وَّاَنْتَ خَیْرُ الْوَارِثِیْنَ
اے میرے رب! مجھے اکیلا نہ چھوڑ اور تو سب وارثوں
سے بہتر ہے۔
(89سورة الانبیاء:)
:3دعا نمبر
رَبِّ ھَبْ لِیْ مِنْ لَّدُنْكَ ذُرِّیَّةً طَیِّبَةً اِنَّكَ سَمِیْعُ الدُّعَآءِ
اے میرے رب! مجھے اپنی طرف سے نیک اور پاکیزه
اولاد عطا فرما، بے شک تو ہی دعا سننے والا ہے۔
(38سورة آل عمران:)
:اولاد کے حصول کیلئے استغفار کیجئےۭ اِنَّہٗ كَانَ غَفَّارًا۝ یُّرْسِلِ السَّمَاۗءَ ٠فَقُلْتُ اسْتَغْفِرُوْا رَبَّكُمْ۝عَلَیْكُمْ مِّدْرَارًا۝ وَّیُمْدِدْكُمْ بِاَمْوَالٍ وَّبَنِیْنَ
۝)نوح کہتے ہیں)تو میں نے کہا کہ اپنے رب سے
بخشش مانگ لو، بلاشبہ وه بہت معاف کرنے والا ہے۔ وه تم
پر آسمان سے خوب بارشیں برسائے گا۔ اور تمہاری مال
اور اولاد سے مدد کرے گا۔
(12تا10سورة نوح:)
ایسی اولاد کی دعا کرنا جو علمی وراث بنے
ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهٗ زَكَرِیَّا۝اِذْ نَادٰى رَبَّہٗ نِدَاۗءً خَفِیًّا۝قَالَ
رَبِّ اِنِّىْ وَہَنَ الْعَظْمُ مِنِّيْ وَاشْتَعَلَ الرَّاْسُ شَیْبًا وَّلَمْ اَكُنْۢ بِدُعَاۗىِٕكَ
رَبِّ شَقِیًّا۝وَاِنِّىْ خِفْتُ الْمَوَالِيَ مِنْ وَّرَاۗءِيْ وَكَانَتِ امْرَاَتِيْ
عَاقِرًا فَہَبْ لِيْ مِنْ لَّدُنْكَ وَلِیًّا۝ یَّرِثُنِيْ وَیَرِثُ مِنْ اٰلِ
ۤۖ وَاجْعَلْہُ رَبِّ رَضِیًّا٠۝یَعْقُوْبَ۝۝یہ آپ کے رب کی اس رحمت کا ذکر ہے جو اس نے
اپنے بندے زکریا پر کی تھی۔ جب زکریا نے اپنے رب کو
چپکے چپکے پکارا۔ اور کہا: اے میرے رب! میری ہڈیاں
بوسیده ہو چکیں اور بڑھاپے کی وجہ سے سر کے بال سفید 
ہو گئے، تاہم اے میرے رب! میں تجھے پکار کر کبھی
محروم نہیں رہا۔ میں اپنے پیچھے قرابت داروں ڈرتا ہوں
اور میری بیوی بانجھ ہے تو اپنے پاس سے مجھے ایک
وارث عطا فرما۔ جو میرا اور آل یعقوب کا وارث بنے اور
اے میرے رب! اسے پسندیده انسان بنانا۔
(6تا2سورة مریم:)
:اولاد کی فرمانبرداری کیلئے دعا
ۤۖ رَبَّنَا وَتَقَبَّلْ ٠رَبِّ اجْعَلْنِيْ مُقِیْمَ الصَّلٰوةِ وَمِنْ ذُرِّیَّتِيْ۝دُعَاۗءِ۝رَبَّنَا اغْفِرْلِيْ وَلِوَالِدَيَّ وَلِلْمُؤْمِنِیْنَ یَوْمَ یَقُوْمُ الْحِسَابُ۝اے میرے رب ! مجھے نماز قائم کرنے والا بنا اور میری
اولاد میں سے بھی، اے ہمارے رب ! اور میری دعا قبول
کر۔اے ہمارے رب ! مجھے بخش دے اور میرے ماں باپ
(ابراہیم کو اور ایمان والوں کو، جس دن حساب قائم ہوگا۔
:41(:اولاد کو الله کے راستےمیں قبول کرنے کی دعا
ۚ اِنَّكَ ٠رَبِّ اِنِّىْ نَذَرْتُ لَكَ مَا فِيْ بَطْنِىْ مُحَرَّرًا فَتَقَبَّلْ مِنِّىْ۝اَنْتَ السَّمِیْعُ الْعَلِیْمُ۝اے میرے رب! بے شک میں نے تیرے لیے اس کی نذر
مانی ہے جو میرے پیٹ میں ہے کہ آزاد چھوڑا ہوا ہو گا، 
سو مجھ سے قبول فرما، بے شک تو ہی سب کچھ سننے
والا، سب کچھ جاننے والا ہے۔
(35سورة آل عمران :)
:اولاد کو شیطان کے شر سے محفوظ رکھنے کی دعا
وَاِنِّىْٓ اُعِیْذُھَا بِكَ وَذُرِّیَّــتَہَا مِنَ الشَّیْطٰنِ الرَّجِیْمِ۝بے شک میں اس کو اور اس کی اولاد کو شیطان مردود
سے تیری پناه میں دیتی ہوں۔
(36آل عمران:)
:اولاد کی اصلاح کیلئے دعا
رَبِّ اَوْزِعْنِيْٓ اَنْ اَشْكُرَ نِعْمَتَكَ الَّتِيْٓ اَنْعَمْتَ عَلَيَّ وَعَلٰي وَالِدَيَّ
ۭۚ اِنِّىْ تُبْتُ ٠وَاَنْ اَعْمَلَ صَالِحًا تَرْضٰىہُ وَاَصْلِحْ لِيْ فِيْ ذُرِّیَّتِيْ۝اِلَیْكَ وَاِنِّىْ مِنَ الْمُسْلِمِیْنَ۝اے میرے رب! مجھے توفیق دے کہ میں تیرے اس احسان
کا شکر ادا کروں جو تو نے مجھ پر اور میرے والدین پر
کیا ہے اور یہ بھی کہ میں ایسے اچھے عمل کروں جو
تجھے پسند ہوں اور میری خاطر میری اولاد کی اصلاح
کر، میں تیرے حضور توبہ کرتا ہوں اور بلاشبہ میں
فرمانبردار ہوں۔
(15سورة الاحقاف:)
:بہترین رزق دینے والے سے رزق مانگنا
وَارْزُقْنَا وَاَنْتَ خَیْرُ الرّٰزِقِیْنَ
اور ہمیں رزق دے اور تو سب رزق دینے والوں سے بہتر
ہے۔
(114سورة المائده:)
:رزق کے حصول کیلئے استغفار کرنا
ۭ اِنَّہٗ كَانَ غَفَّارًا۝ یُّرْسِلِ السَّمَاۗءَ ٠فَقُلْتُ اسْتَغْفِرُوْا رَبَّكُمْ۝عَلَیْكُمْ مِّدْرَارًا۝وَّیُمْدِدْكُمْ بِاَمْوَالٍ وَّبَنِیْنَ وَیَجْعَلْ لَّكُمْ جَنّٰتٍ
وَّیَجْعَلْ لَّكُمْ اَنْہٰرًا۝(نوح کہتے ہیں) تو میں نے کہا کہ اپنے رب سے بخشش
مانگو، بلاشبہ وه بہت معاف کرنے والا ہے۔ وه تم پر آسمان
سے خوب بارشیں برسائے گا اور تمہاری مال اور بیٹوں
سے مدد کرے گا اور تمہارے لیے باغات پیدا کرے گا اور
)12 تا10نہریں جاری کرے گا۔(سورة نوح:
رقیہ شرعیہجادو سے حفاظت کی آیات
درجہ ذیل قرآ نی آیات:سورة االفاتحہ بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِیْمِ۝ اَلْحَمْدُ ِ رَبِّ الْعٰلَمِیْنَ۝الرَّحْمٰنِ
الرَّحِیْمِ۝ مٰلِكِ یَوْمِ الدِّیْنِ۝ اِیَّاكَ نَعْبُدُ وَاِیَّاكَ نَسْتَعِیْنُ۝ اِھْدِنَا
الصِّرَاطَ الْمُسْتَـقِیْمَ۝صِرَاطَ الَّذِیْنَ اَنْعَمْتَ عَلَیْہِمْ ۥۙ غَیْرِ
الْمَغْضُوْبِ عَلَیْہِمْ وَلاَالضَّاۗلِّیْنَ۝تمام تعریفیں الله کے لیے ہے جو سارے جہانوں کا پالنے
والا ہے۔ جو بڑا مہربان نہایت رحم کرنے والا ہے۔ بدلے
کے دن کا مالک ہے۔ ہم صرف تیری عبادت کرتے ہیں اور
صرف تجھ سے ہم مدد مانگتے ہیں۔ ہمیں سیدھے راستے
پر چلا۔ ان لوگوں کے راستے پر جن پر تو نے انعام کیا،
جن پر نہ غصہ کیا گیا اور نہ وه گمراه ہیں۔
خارجہ بن صلت تمیمی اپنے چچا ( علاقہ بن صحار
سلیطی التمیمی رضی الله عنہ) سے روایت کرتے ہیں کہ وه
 کے پاس آئے اور اسلام قبول کیا ۔ پھر واپس نبی کریم
لوٹے تو ایک قوم کے پاس سے گزرے ’ ان کے ہاں ایک
مجنون آدمی تھا جو زنجیروں میں جکڑا ہوا تھا ۔ اس کے
گھر والوں نے ان سے کہا : تحقیق ہمیں خبر ملی ہے کہ
 ) خیر کے ساتھ آیا ہے تمہارا یہ ساتھی ( یعنی رسول الله
۔ تو کیا تمہارے پاس کوئی چیز ہے جس سے تم اس کا
علاج کر دو ؟ چنانچہ میں نے اس کو سورة فاتحہ سے دم
کیا تو وه ٹھیک ہو گیا ۔ پھر انہوں نے مجھے سو بکریاں
 کی خدمت میں حاضر ہو اور آپ دیں تو میں رسول الله
 نے پوچھا “ کیا بس یہی ؟ ” مسدد کو خبر دی ۔ آپ
نے دوسرے موقع پر کہا : “ کیا تم نے اس کے علاوه بھی
 نے فرمایا “ کچھ پڑھا تھا ؟ ” میں نے کہا : نہیں ۔ تو آپ
لے لو ۔ قسم میری عمر کی ! لوگ باطل دم جھاڑ سے
کھاتے ہیں ’ جبکہ تم ایسے دم سے کھا رہے ہو جو حق ہے
(3896سنن ابی داؤد:)۔:سورة البقره شیطان کا توڑ
 نے فرمایا:سورة البقره پڑھا کرو کیونکہ اس کا رسول الله
پڑھناباعث برکت اور اسے چھوڑنا باعث حسرت ہے اور
اس کے پڑھنے والے پر جادوگر قدرت نہیں پا
)1874سکتے۔(صحیح مسلم:
سیدنا ابوہریره رضی الله عنہ بیان کرتے ہیں کہ رسول الله
 نے فرمایا:تم اپنے گھروں کو قبر ستان نہ بناؤ کیونکہ 
شیطان اس گھر سے بھاگ جاتا ہے جس گھر میں سورة
)1824البقره کی تلاوت کی جاتی ہے۔(صحیح مسلم:
5 تا 1سورة البقرة کی آیات
ۚۛھُدًى لِّلْمُتَّقِیْنَ۝الَّذِیْنَ ٠ ۛۖۚفِیْہِ٠۝الۗمّۗ۝ذٰلِكَ الْكِتٰبُ لاَ رَیْبَ۝یُؤْمِنُوْنَ بِالْغَیْبِ وَیُـقِیْمُوْنَ الصَّلٰوةَ وَمِمَّا رَزَقْنٰھُمْ
یُنْفِقُوْنَ۝وَالَّذِیْنَ یُؤْمِنُوْنَ بِمَآ اُنْزِلَ اِلَیْكَ وَمَآ اُنْزِلَ مِنْ
ۚ وَبِالاْٰخِرَةِ ھُمْ یُوْقِنُوْنَ۝اُولٰۗىِٕكَ عَلٰي ھُدًى مِّنْ ٠قَبْلِكَ۝ۤوَاُولٰۗىِٕكَ ھُمُ الْمُفْلِحُوْنَ٠۝رَّبِّہِمْ۝الم۔یہ کتاب ،اس میں کوئی شک نہیں ، تقوی والوں کے لیے
سراسر ہدایت ہے۔وه لوگ جو غیب پر ایمان لاتے ہیں اور
نماز قائم کرتے ہیں اور جو ہم نے انہیں دیا،اس میں سے
خرچ کرتے ہیں اور وه جو اس پر ایمان لا تے ہیں جو
تیری طرف اتارا گیا اور جو تجھ سے پہلے اتارا گیا اور وه
آخرت پر یقین رکھتے ہیں ۔یہی لوگ اپنے رب کی طرف
سے ہدایت پر ہیں اور یہی لوگ کامیاب ہیں
102سورة البقرة:آیت نمبر
ۚ وَمَا كَفَرَ سُلَیْمٰنُ ٠وَاتَّبَعُوْا مَا تَتْلُوا الشَّیٰطِیْنُ عَلٰي مُلْكِ سُلَیْمٰنَ۝ۤ وَمَآ اُنْزِلَ عَلَي ٠وَلٰكِنَّ الشَّیٰطِیْنَ كَفَرُوْا یُعَلِّمُوْنَ النَّاسَ السِّحْرَ۝ۭ وَمَا یُعَلِّمٰنِ مِنْ اَحَدٍ حَتّٰى ٠الْمَلَكَیْنِ بِبَابِلَ ھَارُوْتَ وَمَارُوْتَ۝
ۭ فَیَتَعَلَّمُوْنَ مِنْہُمَا مَا یُفَرِّقُوْنَ بِہٖ ٠یَقُوْلآَ اِنَّمَا نَحْنُ فِتْنَۃٌ فَلاَ تَكْفُرْ۝ۭ وَمَا ھُمْ بِضَاۗرِّیْنَ بِہٖ مِنْ اَحَدٍ اِلاَّ بِـاِذْنِ ٠بَیْنَ الْمَرْءِ وَزَوْجِہٖ۝ۭ وَلَقَدْ عَلِمُوْا لَمَنِ ٠ ۭوَیَتَعَلَّمُوْنَ مَا یَضُرُّھُمْ وَلاَ یَنْفَعُھُمْ٠۝اللهِ۝ۣۭ وَلَبِئْسَ مَا شَرَوْا بِہٖٓ ٠اشْتَرٰىہُ مَا لَہٗ فِي الاْٰخِرَةِ مِنْ خَلاَقٍ۝ۭ لَوْ كَانُوْا یَعْلَمُوْنَ٠۝اَنْفُسَھُمْ۝اور انہوں نے اس کی پیروی کی جسے شیطان
سلیمان(علیہ السلام) کی بادشاہت میں پڑھتے تھے ، اور
سلیمان(علیہ السلام) نے کفر نہیں کیا بلکہ شیطانوں نے کفر
کیا ، وه لوگوں کو جادو سکھاتے (اور اس کی پیروی
کرتے) جو بابل (شہر)میں ہاروت اور ماروت دو فرشتوں
پر نازل کیا گیا ، حالانکہ وه دونوں کسی ایک کو نہیں
سکھاتے تھے، یہاں تک کہ وه دونوں کہتے ہم تو محض
ایک آزمائش ہیں لہٰذا تم کفر نہ کرو، چنانچہ وه ان دونوں
سے جادو سیکھتے جس کے ذریعے سے وه شوہر اور اس
کی بیوی کے درمیان جدائی ڈالتے اور وه اس جادو سے الله
کے حکم کے سوا کسی کو نقصان نہیں پہنچا سکتے تھے ۔
اور وه ان سے وه علم سیکھتے تھے جو انہیں نقصان
پہنچاتا اور انہیں نفع نہ دیتا، حالانکہ یقینا وه جانتے تھے کہ
جس نے اسے خریدا، آخرت میں اس کے لیے کوئی حصہ
نہیں ، اور البتہ وه بہت بری چیز تھی جس کے بدلے میں
انہوں نے اپنی جانیں بیچ ڈالیں کاش! وه جان لیتے۔
:164تا 163سورة البقرة آیت نمبر
وَاِلٰھُكُمْ اِلٰھٌ وَّاحِدٌ لآَ اِلٰھَ اِلاَّھُوَ الرَّحْمٰنُ الرَّحِیْمُ۝ اِنَّ فِیْ خَلْقِ
السَّمٰوٰتِ وَالاَْرْضِ وَاخْتِلاَفِ الَّیْلِ وَالنَّھَارِ وَالْفُلْكِ الَّتِیْ تَجْرِیْ
فِی الْبَحْرِبِمَا یَنْفَعُ النَّاسَ وَمَآ اَنْزَلَ اللهُ مِنَ السَّمَآءِ مِنْ مَّآئٍ فَاَحْیَا
بِھِ الاَْرْضَ بَعْدَ مَوْتِھَا وَبَثَّ فِیْھَا مِنْ كُلِّ دَآبَّةٍ وَّتَصْرِیْفِ الرِّیٰحِ
وَالسَّحَابِ الْمُسَخَّرِ بَیْنَ السَّمَآءِ وَالاَْرْضِ لاَٰیٰتٍ لِّقَوْمٍ یَّعْقِلُوْنَ۝اور تمہارا معبود ایک ہی معبود ہے ،اس کے سوا کوئی
معبود نہیں ،وه نہایت مہربان ہے،بہت رحم فرمانے والا
ہے۔بے شک آسمانوں اور زمین کی پیدائش اور رات و دن
کے بدل بدل کر آنے جانے میں اور ان کشتیوں میں جو
سمندر میں ان چیزوں کو لیے چلتی ہینجو لوگوں کو نفع
دیتی ہیں اور الله کے نازل کرده آسمانی پانی میں کہ اس
کے ذریعے زمین کو اس کی موت کے بعد زنده کیا اور ہر
قسم کے جانورونمیں جو اس میں پھیلائے ہیں اور ہوائوں
کے پھیرنے میں اورآسمان و زمین کے درمیان مسخرکیے
جانے والے بادلوں میں ان لوگوں کے لیے نشانیاں ہیں جو
عقل رکھتے ہیں:255سورة البقرة آیت نمبر
٠ ۚاَلْـحَيُّ الْقَیُّوْمُ لاَ تَاْخُذُهٗ سِـنَۃٌ وَّلاَ نَوْمٌ٠۝اللهَُ لآَ اِلٰہَ اِلاَّ ھُوَ۝ ۭ مَنْ ذَا الَّذِيْ یَشْفَعُ عِنْدَهٗٓ ٠لَہٗ مَا فِي السَّمٰوٰتِ وَمَا فِي الاَْرْضِ۝
ۚ وَلاَ یُحِیْطُوْنَ ٠ ۭیَعْلَمُ مَا بَیْنَ اَیْدِیْہِمْ وَمَا خَلْفَھُمْ٠۝اِلاَّ بِـاِذْنِہٖ۝ۚ وَسِعَ كُرْسِـیُّہُ السَّمٰوٰتِ ٠بِشَيْءٍ مِّنْ عِلْمِہٖٓ اِلاَّ بِمَا شَاۗءَ۝ۚ وَھُوَالْعَلِيُّ ٠ ۚوَلاَ یَـــــُٔـــوْدُهٗ حِفْظُہُمَا٠۝وَالاَْرْضَ۝الْعَظِیْمُ۝۝الله کے سوا کوئی معبود نہیں، وه زنده اور قائم رہنے
والا ہے، اسے نہ اونگھ آتی ہے اورنہ نیند، اسی کے لیے
ہے جوآسمانوں اور زمین میں ہے، کون ہے جو اس کی
اجازت کے بغیر اس کے سامنے شفاعت کرسکے، وه جانتا
ہے جو ان کے آگے اور پیچھے ہے، اور وه اس کے علم
میں سے کسی چیز کا احاطہ نہیں کر سکتے سوائے اس
کے جو وه چاہے، اس کی کرسی آسمانوں اور زمین تک
وسیع ہے اور ان کی حفاظت اسے نہیں تھکاتی اور وه بہت
بلند اور بہت عظمت والا ہے۔
:286تا 285سورة البقرةآیت نمبر
اٰمَنَ الرَّسُوْلُ بِمَآ اُنْزِلَ اِلَیْہِ مِنْ رَّبِّہٖ وَالْمُؤْمِنُوْنَ كُلٌّ اٰمَنَ بِاِ
٠ ۣلاَ نُفَرِّقُ بَیْنَ اَحَدٍ مِّنْ رُّسُلِہٖ٠۝وَمَلٰۗىِٕكَتِہٖ وَكُتُبِہٖ وَرُسُلِہٖ۝ ۣۤۡ غُفْرَانَكَ رَبَّنَا وَاِلَیْكَ الْمَصِیْرُ۝ لاَ ٠وَقَالُوْا سَمِعْنَا وَاَطَعْنَا۝ۭ لَہَا مَا كَسَبَتْ وَعَلَیْہَا ٠یُكَلِّفُ اللهُ نَفْسًا اِلاَّ وُسْعَہَا۝ۚ رَبَّنَا ٠ ۭرَبَّنَا لاَ تُؤَاخِذْنَآ اِنْ نَّسِیْنَآ اَوْ اَخْطَاْنَا٠۝مَااكْتَسَبَتْ
ۚ رَبَّنَا ٠وَلاَ تَحْمِلْ عَلَیْنَآ اِصْرًا كَـمَا حَمَلْتَہٗ عَلَي الَّذِیْنَ مِنْ قَبْلِنَا۝ ۪ وَاغْفِرْ لَنَا ٠ ۚوَاعْفُ عَنَّا ٠۝وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَۃَ لَنَا بِہٖ۝۪ اَنْتَ مَوْلٰىنَا فَانْصُرْنَا عَلَي الْقَوْمِ ٠ ۪وَارْحَمْنَا ۝٠۝الْكٰفِرِیْنَ۝رسول ایمان لایا اس پرجو اس کے رب کی طرف سے نازل
کیا گیااور سب مومن بھی ،سب کے سب ایمان لائے الله
پر،اس کے فرشتوں پر،اس کی کتابوں پراوراس کے
رسولوں پر ۔ ہم اس کے رسولوں میں سے کسی مینفرق
نہیں کرتے اور وه کہتے ہیں ہم نے سنا اور ہم نے اطاعت
کی، تیری بخشش (مانگتے ہیں )اے ہمارے رب اور تیری
طرف ہی لوٹنا ہے۔الله کسی کو اس کی طاقت سے زیاده
تکلیف نہیں دیتا،اسی کے لیے ہے جو اس نے (نیکی) کی
اور اس پر ہے جو اس نے (گناه )کمایا،اے ہمارے رب!
اگر ہم بھول جائیں یا ہم خطا کر لیں تو ہمیں نہ پکڑنا،اے
ہمارے رب !ہم پر وه بوجھ نہ ڈال جیسا کہ تونے ہم سے
پہلے لوگوں پر ڈالا ، اے ہمارے رب! توہم سے وه بوجھ نہ
اٹھواجس کے اٹھانے کی طاقت ہم میں نہیں ، ہم سے
درگزر فرما اور ہمیں بخش دے اورہم پر رحم فرما،تو ہی
ہمارا مولا ہے پس کافر قوم کے مقابلے میں ہماری مدد فرما
:122تا 117سورة الاعراف:
ۚ فَاِذَا ہِىَ تَلْقَفُ مَا ٠وَاَوْحَیْنَآ اِلٰى مُوْسٰٓي اَنْ اَلْقِ عَصَاكَ۝یَاْفِكُوْنَ ۝ فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوْا یَعْمَلُوْنَ ۝ فَغُلِبُوْا
ہُنَالِكَ وَانْقَلَبُوْا صٰغِرِیْنَ ۝ وَاُلْقِيَ السَّحَرَةُ سٰجِدِیْنَ ۝ قَالُوْٓا
اٰمَنَّا بِرَبِّ الْعٰلَمِیْنَ ۝ رَبِّ مُوْسٰي وَہٰرُوْنَ ۝اور ہم نے موسیٰ کو وحی کی کہ وه اپنا عصا پھینک دے،
تو اچانک وه ان چیزوں کو نگلنے لگا جو وه جھوٹ موٹ
بنا رہے تھے ۔ چنانچہ سچی بات ثابت ہوگئی اور اُن کا کیا
کرایاسب باطل ہوگیا سو اس موقع پر وه سب مغلوب ہو گئے
اور ذلیل ہو کر لوٹے ۔اور جادوگر سجده میں گر پڑے۔
کہنے لگے ہم ایمان لائے رب العالمین پر جو موسیٰ اور
ہارون کا رب ہے:82تا 81سورة یونس :
ۭ اِنَّ اللهَ ٠ ۙالسِّحْرُ٠۝فَلَمَّآ اَلْقَوْا قَالَ مُوْسٰى مَا جِئْتُمْ بِہِ۝ۭ اِنَّ اللهَ لاَ یُصْلِحُ عَمَلَ الْمُفْسِدِیْنَ ۝ وَیُحِقُّ اللهُ ٠سَیُبْطِلُہٗ۝الْحَقَّ بِكَلِمٰتِہٖ وَلَوْ كَرِهَ الْمُجْرِمُوْنَ ۝۝جب انہوں نے پھینکا تو موسیٰ نے کہا یہ جو تم لے کر
آئے ہو یہ تو جادو ہے، بے شک الله اسے جلد ہی باطل کر
دے گا، اس لیے کہ الله مفسدین کا کام درست نہیں کرتا۔ اور
الله حق کو اپنے کلمات کے ذریعے ثابت کردے گا خواه
مجرم لوگ اِس کو ناپسند ہی کریں۔
:69سورة طٰہٰ:
ۭ اِنَّمَا صَنَعُوْا كَیْدُ ٠وَاَلْقِ مَا فِيْ یَمِیْنِكَ تَلْقَفْ مَا صَنَعُوْا۝ۭ وَلاَ یُفْلِحُ السَّاحِرُ حَیْثُ اَتٰى٠۝سٰحِرٍ۝۝ جو تمہارے داہنے ہاتھ میں ہے اُسے ڈال دو، وه نگل
جائے گا جو کچھ اُنہوں نے بنایا۔ بے شک اُنہوں نے جو
کچھ بنایا وه جادوگر کی چال ہے اور جادوگر کہیں سے
بھی آجائے کامیاب نہیں ہو سکتا۔
:118تا 115سورة المؤمنون آیت نمبر
اَفَحَسِبْتُمْ اَنَّمَا خَلَقْنٰكُمْ عَبَثًا وَّاَنَّكُمْ اِلَیْنَا لاَ تُرْجَعُوْنَ۝ فَتَعٰلَى اللهُ
ۚ رَبُّ الْعَرْشِ الْكَرِیْمِ۝ وَمَنْ ٠ ۚلآَ اِلٰہَ اِلاَّ ہُوَ٠۝الْمَلِكُ الْحَقُّ۝ۙ فَاِنَّمَا حِسَابُہٗ ٠ ۙلاَ بُرْہَانَ لَہٗ بِہٖ٠۝یَّدْعُ مَعَ اللهِ اِلٰــہًا اٰخَرَ۝ۭ اِنَّہٗ لاَ یُفْلِحُ الْكٰفِرُوْنَ۝ وَقُلْ رَّبِّ اغْفِرْ وَارْحَمْ ٠عِنْدَ رَبِّہٖ۝وَاَنْتَ خَیْرُ الرّٰحِمِیْنَ۝کیا تم نے گمان کر لیا کہ ہم نے تمہیں بے فائده پیدا کیا ہے
اور یہ کہ تم ہماری طرف لوٹ کر نہیں آئو گے؟ پس بہت
بلند ہے الله، سچا بادشاه ، اس کے سوا کوئی معبود نہیں ،وه
عزت والے عرش کا رب ہے ۔ اور جو شخص الله کے ساتھ
کسی دوسرے معبود کو پکارے جس کی کوئی دلیل اس کے
پاس نہیں ، تو یقینا اس کا حساب اس کے رب کے پاس ہے
۔ بے شک کافر لوگ فلاح نہیں پائیں گے ۔ اور آپ کہیں اے 
میرے رب ! (میری) مغفرت فرما، اور(مجھ پر) رحم فرما
اور تو رحم کرنے والوں میں سب سے بہتر (رحم کرنے
والا) ہے:10تا 1سورة الصٰفٰت آیت نمبر
وَالصّٰۗفّٰتِ صَفًّا۝ فَالزّٰجِرٰتِ زَجْرًا۝فَالتّٰلِیٰتِ ذِكْرًا۝اِنَّ اِلٰہَكُمْ
لَوَاحِدٌ۝رَبُّ السَّمٰوٰتِ وَالاَْرْضِ وَمَا بَیْنَہُمَا وَرَبُّ الْمَشَارِقِ۝اِنَّا زَیَّنَّا
السَّمَاۗءَ الدُّنْیَا بِزِیْنَۃِۨ الْكَـوَاكِبِ۝وَحِفْظًا مِّنْ كُلِّ شَیْطٰنٍ
مَّارِدٍ۝لاَ یَسَّمَّعُوْنَ اِلَى الْمَلاَِ الاَْعْلٰي وَیُقْذَفُوْنَ مِنْ كُلِّ
جَانِبٍ۝ دُحُوْرًا وَّلَہُمْ عَذَابٌ وَّاصِبٌ۝اِلاَّ مَنْ خَطِفَ الْخَــطْفَۃَ
فَاَتْــبَعَہٗ شِہَابٌ ثَاقِبٌ۝۝ قسم ہے ان (فرشتوں) کی جو صف باندھنے والے ہیں
خوب صف باندھنا، پھر ان کی جو ڈانٹنے والے ہیں
زبردست ڈانٹنا، پھر ان کی جو ذکرکرنے والے ہیں بلاشبہ
تمہارا الٰہ ایک ہی ہے، وه جو آسمانوں اور زمین کا اور ان
دونوں کے درمیان کی چیزوں کارب ہے اور( سارے)
مشرقوں کا رب ہے۔ بلاشبہ ہم نے آسمانِ دنیا کو ستاروں
کی زینت سے مزین کیا ہے اور اسے ہر سرکش شیطان
سے محفوظ بنا دیا ہے، وه عالم بالا کی باتیں سن نہیں
سکتے،اور ہر طرف سے(ان پر شہاب) پھینکے جاتے ہیں 
تاکہ وه بھاگ کھڑے ہوں اور ان کے لیے ہمیشہ رہنے والا
عذاب ہے۔ تا ہم اگر کوئی (شیطان کوئی بات) اچانک اچک
کرلے اڑے تو ایک چمکتا ہوا شعلہ اس کا پیچھا کرتا ہے
:33تا 29سورة الاحقاف آیت نمبر
ۚ فَلَمَّا ٠وَاِذْ صَرَفْنَآ اِلَیْكَ نَفَرًا مِّنَ الْجِنِّ یَسْتَمِعُوْنَ الْقُرْاٰنَ۝ۚ فَلَمَّا قُضِيَ وَلَّوْا اِلٰى قَوْمِہِمْ ٠حَضَرُوْهُ قَالُوْٓا اَنْصِتُوْا۝مُّنْذِرِیْنَ۝قَالُوْا یٰقَوْمَنَآ اِنَّا سَمِعْنَا كِتٰبًا اُنْزِلَ مِنْۢ بَعْدِ مُوْسٰى
مُصَدِّقًا لِّمَا بَیْنَ یَدَیْہِ یَہْدِيْٓ اِلَى الْحَـقِّ وَاِلٰى طَرِیْقٍ مُّسْـتَقِیْمٍ۝
یٰقَوْمَنَآ اَجِیْبُوْا دَاعِيَ اللهِ وَاٰمِنُوْا بِہٖ یَغْفِرْ لَكُمْ مِّنْ ذُنُوْبِكُمْ وَیُجِرْكُمْ
مِّنْ عَذَابٍ اَلِیْمٍ۝وَمَنْ لاَّ یُجِبْ دَاعِيَ اللهِ فَلَیْسَ بِمُعْجِزٍ فِي
ۭ اُولٰۗىِٕكَ فِيْ ضَلٰـلٍ ٠الاَْرْضِ وَلَیْسَ لَہٗ مِنْ دُوْنِہٖٓ اَوْلِیَاۗءُ۝مُّبِیْنٍ۝اَوَلَمْ یَرَوْا اَنَّ اللهَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالاَْرْضَ وَلَمْ یَعْيَ
ۭ بَلٰٓي اِنَّہٗ عَلٰي كُلِّ ٠بِخَلْقِہِنَّ بِقٰدِرٍ عَلٰٓي اَنْ یُّـحْيِۦ الْمَوْتٰى۝شَيْءٍ قَدِیْرٌ۝۝اور جب ہم نے جنوں کی ایک جماعت کو آپ کی
طرف پھیرا،جبکہ وه قرآن غور سے سنتے تھے ،پھر جب
وه (نبی کی تلاوت سننے )ان کے پاس حاضر ہوئے ،تو
(ایک دوسرے سے )کہنے لگے خاموش ہو جاؤ پھر جب
(قرآن )پڑھا جاچکا تووه اپنی قوم کو ڈرانے والے بن
کرلوٹے۔ کہنے لگے: اے ہماری قوم!بے شک ہم نے ایک
کتاب سنی ہے جو موسیٰ کے بعد نازل کی گئی ہے وه ان 
کتابوں کی تصدیق کرتی ہے جواس سے پہلے کی ہیں،وه
حق کی طرف اور صراط مستقیم کی طرف راه نمائی کرتی
ہے۔اے ہماری قوم!الله کے داعی کی بات کوقبو ل
کرلو،اوراس پر ایمان لے آئو ،وه تمہارے لیے تمہارے گناه
بخش دے گا اور تمہیں دردناک عذاب سے پنا ه دے گا۔ اور
جوکوئی الله کے داعی کی بات قبول نہیں کرے گاتو وه
زمین میں ( الله کو )عاجز نہیں کر سکے گااور اس کے سوا
اس کا کوئی مددگارنہینہو گا،یہی لوگ کھلی گمراہی میں ہیں
۔کیا وه نہیں دیکھتے کہ بے شک الله ،جس نے آسمانوں اور
زمین کو پیدا کیا او روه ان کے پیدا کرنے سے
تھکانہیں،اس پر قادر ہے کہ مردوں کو زنده کرے ؟کیوں
 نہیں!بلا شبہ وه ہر چیز پر کمال قدرت رکھنے والاہے۔
:36تا 33سورة الرحمٰن آیت نمبر
یٰمَعْشَرَ الْجِنِّ وَالاِْنْسِ اِنِ اسْتَطَعْتُمْ اَنْ تَنْفُذُوْا مِنْ اَقْطَارِ السَّمٰوٰتِ
ۭ لاَ تَنْفُذُوْنَ اِلاَّ بِسُلْطٰنٍ۝فَبِاَيِّ اٰلاَۗءِ رَبِّكُمَا ٠وَالاَْرْضِ فَانْفُذُوْا۝ۥۙ وَّنُحَاسٌ فَلاَ ٠تُكَذِّبٰنِ۝یُرْسَلُ عَلَیْكُمَا شُوَاظٌ مِّنْ نَّارٍ۝تَنْتَصِرٰنِ۝فَبِاَيِّ اٰلاَۗءِ رَبِّكُمَا تُكَذِّبٰنِ۝۝اے گروه جن وانس ! اگر تم آسمانوں اور زمین کے
کناروں سے باہر نکل بھاگنے کی طاقت رکھتے ہو تو نکل
جائو! کسی غلبے کے بغیر تو تم نکل ہی نہیں سکتے۔ پھرتم
دونوں اپنے رب کی کس کس نعمت کو جھٹلائو گے؟ تم 
دونوں پر آگ کا شعلہ اور دھواں چھوڑاجائے گا پھر تم
دونوں بچ نہ سکو گے۔پھر تم دونوں اپنے رب کی کس کس
نعمت کو جھٹلائو گے؟
:24تا21سورة الحشر آیت نمبر
لَوْ اَنْزَلْنَا ہٰذَا الْقُرْاٰنَ عَلٰي جَبَلٍ لَّرَاَیْتَہٗ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْـیَۃِ
ۭ وَتِلْكَ الاَْمْثَالُ نَضْرِبُہَا لِلنَّاسِ لَعَلَّہُمْ یَتَفَكَّرُوْنَ۝ہُوَاللهُ ٠اللهِ۝ۚ ہُوَالرَّحْمٰنُ ٠ ۚعٰلِمُ الْغَیْبِ وَالشَّہَادَةِ٠۝الَّذِيْ لآَ اِلٰہَ اِلاَّ ہُوَ۝ۚ اَلْمَلِكُ الْقُدُّوْسُ السَّلٰمُ ٠الرَّحِیْمُ۝ہُوَاللهُ الَّذِيْ لآَ اِلٰہَ اِلاَّ ہُوَ۝ۭ سُبْحٰنَ اللهِ عَمَّا ٠الْمُؤْمِنُ الْمُہَیْمِنُ الْعَزِیْزُ الْجَبَّارُ الْمُتَكَبِّرُ۝یُشْرِكُوْنَ۝ہُوَاللهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَہُ الاَْسْمَاۗءُ
ۚ ٠ ۭیُسَبِّحُ لَہٗ مَا فِي السَّمٰوٰتِ وَالاَْرْضِ٠۝الْحُسْنٰى۝وَہُوَالْعَزِیْزُ الْحَكِیْمُ۝!) اگر ہم اس قرآن کو کسی پہاڑ پرنازل کرتے (اے نبی
تو آپ دیکھتے کہ وه الله کے خوف سے دب جاتا اور پھٹ
جاتا او ریہ مثالیں ہم لوگوں کے لیے بیان کرتے ہیں شاید
کہ وه غور و فکر کریں۔وه الله ہی ہے جس کے سوا کوئی
معبود نہیں، ہر چھپی اور کھلی چیز کو جاننے والا ہے،
وہی بے حد مہربان نہایت رحم کرنے والا ہے ۔ وه الله ہی
ہے جس کے سوا کوئی معبود نہیں، بادشاه ہے، نہایت پاک
، سراسر سلامتی والا ، امن دینے والا ،نگہبان، سب پر
غالب، اپنی مرضی چلانے والا، بے حد بڑائی والا ہے، 
پاک ہے الله اس سے جو وه شریک ٹھہراتے ہیں۔ وه الله ہی
ہے جو خاکہ بنانے والا، گھڑنے ڈھالنے والا، صورت
بنانے والا ہے، سب اچھے نام اسی کے ہیں، اس کی تسبیح
ہر وه چیز کرتی ہے جو آسمانوں اور زمین میں ہے اور
وہی سب پر غالب، کمال حکمت والا ہے۔
:9تا1سورة الجن آیت نمبر
قُلْ اُوْحِيَ اِلَيَّ اَنَّہُ اسْتَـمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوْٓا اِنَّا سَمِعْنَا قُرْاٰنًا
ۭ وَلَنْ نُّشْرِكَ بِرَبِّنَآ ٠عَجَــبًا۝یَّہْدِيْٓ اِلَى الرُّشْدِ فَاٰمَنَّا بِہٖ۝اَحَدًا۝وَّاَنَّہٗ تَعٰلٰى جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَۃً وَّلاَ وَلَدًا۝وَّاَنَّہٗ
كَانَ یَقُوْلُ سَفِیْہُنَا عَلَي اللهِ شَطَطًا۝وَّاَنَّا ظَنَنَّآ اَنْ لَّنْ تَقُوْلَ
الاِْنْسُ وَالْجِنُّ عَلَي اللهِ كَذِبًا۝وَّاَنَّہٗ كَانَ رِجَالٌ مِّنَ الاِْنْسِ
یَعُوْذُوْنَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوْہُمْ رَہَقًا۝وَّاَنَّہُمْ ظَنُّوْا كَـمَا
ظَنَنْتُمْ اَنْ لَّنْ یَّبْعَثَ اللهُ اَحَدًا۝وَّاَنَّا لَمَسْـنَا السَّمَاۗءَ فَوَجَدْنٰہَا مُلِئَتْ
ۭ فَمَنْ ٠حَرَسًا شَدِیْدًا وَّشُہُبًا۝وَّاَنَّا كُنَّا نَقْعُدُ مِنْہَا مَقَاعِدَ لِلسَّمْعِ۝یَّسْتَمِـــعِ الاْٰنَ یَجِدْ لَہٗ شِہَابًا رَّصَدًا۝ ) آپ کہہ دیں کہ مجھے وحی کی گئی ۝) اے محمد
ہے کہ جنوں کے ایک گروه نے (قرآن ) غور سے سنا اور
انہوں نے کہا کہ ہم نے بڑا عجیب قرآن سنا ہے۔ جو بھلائی
کی طرف راه نمائی کرتا ہے سو ہم اس پر ایمان لے آئے
اور ہم ہر گز کسی کو بھی اپنے رب کا شریک نہیں بنائیں
گے اور بے شک ہمارے رب کی شان بڑی بلند ہے۔ نہ اس 
نے کسی کو بیوی بنایا ہے اور نہ بیٹا اور بلا شبہ یہ ہمارے
بے وقوف لوگ الله کے ذمے بہت سی جھوٹی باتیں لگاتے
رہے ہیں اوریہ کہ ہم نے تو یہ سمجھ رکھا تھا کہ انسان
اور جن الله کے بارے میں ہر گز کبھی جھوٹ نہیں بول
سکتے۔ اور یہ کہ انسانوں میں سے کچھ لوگ جنوں میں
سے کچھ لوگوں کی پناه مانگا کرتے تھے، اسی طر ح
انہوں نے ان(جنوں) کا غرور اور بڑھا دیا ۔ اور یہ کہ ان
(انسانوں) نے بھی وہی گمان کیا جیسا تمہارا گمان تھا کہ الله
کسی کو (رسول بنا کر) نہیں بھیجے گا اور یہ کہ بے شک
ہم نے آسمانوں کو ٹٹولا تو اسے سخت پہریداروں اور
شہابوں سے بھرا ہوا پایا ۔ اور یہ کہ پہلے ہم سُن گُن لینے
کے لیے( آسمان میں) بیٹھنے کی جگہ پالیتے تھے ، مگر
اب جو کان لگاتا ہے وه اپنے لیے گھات میں ایک شہاب
ثاقب لگا ہوا پاتا ہے:سورة الاخلاصبِسْمِ اللهِ الرَّحْمٰنِ الرَّحِیْمِ
ۥۙ وَلَمْ یُوْلَدْ۝وَلَمْ یَكُنْ ٠قُلْ ہُوَاللهُ اَحَدٌ۝اللهَُ الصَّمَدُ۝لَمْ یَلِدْ۝لَّہٗ كُفُوًا اَحَدٌ۝الله کے نام کےساتھ جو بے حد رحم والا،نہایت مہربان ہے۔
کہہ دے وه الله ایک ہے۔ الله ہی بے نیاز ہے ۔نہ اس نے
کسی کو جنا اور نہ ہی وه جنا گیا۔اور نہ کبھی کوئی ایک
اس کے برابر کاہے۔
:سورة الفلقبِسْمِ اللهِ الرَّحْمٰنِ الرَّحِیْمِ
قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ۝مِنْ شَرِّ مَا خَلَقَ۝وَمِنْ شَرِّ غَاسِقٍ اِذَا
وَقَبَ۝وَمِنْ شَرِّ النَّفّٰثٰتِ فِي الْعُقَدِ۝وَمِنْ شَرِّ حَاسِدٍ اِذَا
حَسَدَ۝الله کے نام کےساتھ جو بے حد رحم والا،نہایت مہربان ہے۔
تو کہہ میں مخلوق کے رب کی پناه پکڑتا ہوں۔ اس چیز کے
شر سے جو اس نے پیدا کی۔اور اندھیری رات کے شر سے
جب وه چھا جائے۔اور گرہوں میں پھونکنے والیوں کے شر
سے۔اور حسد کرنے والوں کے شر سے جب وه حسد کرے۔
:سورة الناسبِسْمِ اللهِ الرَّحْمٰنِ الرَّحِیْمِ
قُلْ اَعُوْذُ بِرَبِّ النَّاسِ۝مَلِكِ النَّاسِ۝اِلٰہِ النَّاسِ۝مِنْ شَرِّ
ۥۙ الْخَنَّاسِ۝الَّذِيْ یُوَسْوِسُ فِيْ صُدُوْرِ ٠الْوَسْوَاسِ۝النَّاسِ۝مِنَ الْجِنَّۃِ وَالنَّاسِ۝الله کے نام کےساتھ جو بے حد رحم والا،نہایت مہربان ہے۔
تو کہہ میں پناه پکڑتا ہوں لوگوں کے رب کی۔ لوگوں کے
بادشاه کی ۔ لوگوں کے معبود کی۔وسوسہ ڈالنے والے کے
شر سے، جو ہٹ ہٹ کر آنے والا ہے۔ وه جو لوگوں کے
سینوں میں وسوسہ ڈالتا ہے۔ جنوں اور انسانوں میں سے۔
:نئے علاقے اور بستی میں داخل ہونے کی دعا
رَّبِّ اَدْخِلْنِيْ مُدْخَلَ صِدْقٍ وَّاَخْرِجْنِيْ مُخْــرَجَ صِدْقٍ وَّاجْعَلْ لِّيْ
مِنْ لَّدُنْكَ سُلْطٰنًا نَّصِیْرًا۝اے میرے رب ! داخل کر مجھے سچا داخل کرنا اور نکال
مجھے سچا نکالنا اور میرے لیے اپنی طرف سے ایسا غلبہ
)80بنا جو مددگار ہو۔ (بنی اسرائیل :
:شیطانی شر سے حفاظت کی دعا
رَّبِّ اَعُوْذُ بِكَ مِنْ ھَمَزٰتِ الشَّیٰطِیْنِ وَاَعُوْذُ بِكَ رَبِّ اَنْ
یَّحْضُرُوْنِ
اے میرے رب ! میں شیطانوں کی اکساہٹوں سے تیری پناه
مانگتا ہوں۔ میں اس سے بھی تیری پناه مانگتا ہوں کہ وه
)98میرے پاس آموجود ہوں۔ (المؤمنون:
:دنیا و آخرت کی کامیابی کے لیے دعا
رَبَّنَآ اٰتِنَا فِي الدُّنْیَا حَسَنَۃً وَّفِي الاْٰخِرَةِ حَسَـنَۃً وَّقِنَا عَذَابَ
النَّارِ۝اے ہمارے رب ! ہمیں دنیا میں بھلائی اور آخرت میں بھی
سورة البقرة ) بھلائی دے اور ہمیں آگ کے عذاب سے بچا۔
):201:دوسری دعا
رَبَّنَا اٰتِنَا مِنْ لَّدُنْكَ رَحْمَةً وَّھَیِّئ لَـنَا مِنْ اَمْرِنَا رَشَدًا
اے ہمارے رب ! ہمیں اپنے پاس سے کوئی رحمت عطا
کر اور ہمارے لیے ہمارے معاملے میں کوئی رہنمائی مہیا
)10)سورة الکھف: فرما۔
:تیسری دعا
رَبَّنَا عَلَیْكَ تَوَكَّلْنَا وَاِلَیْكَ اَنَـبْنَا وَاِلَیْكَ الْمَصِیْرُ
اے ہمارے رب ! ہم نے تجھی پر بھروسا کیا اور تیری ہی
طرف رجوع کیا اور تیری ہی طرف لوٹ کر آنا ہے۔
4سورة الممتحن:)
:چوتھی دعا
فَاطِرَ السَّمٰوٰتِ وَالاَْرْضِ اَنْتَ وَلِىّٖ فِى الدُّنْیَا وَالاْٰخِرَةِ تَوَفَّنِىْ
مُسْلِمًا وَّاَلْحِقْنِىْ بِالصّٰلِحِیْنَ
آسمانوں اور زمین کو پیدا کرنے والے ! دنیا اور آخرت میں
تو ہی میرا یار و مددگار ہے، مجھے مسلم ہونے کی حالت
میں فوت کر اور مجھے نیک لوگوں کے ساتھ ملادے۔
)101)یوسف:
:دل کی مضبوطی اور ثابت قدمی کی دعا
ۚ ٠رَبَّنَا لاَ تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ ھَدَیْتَنَا وَھَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَۃً۝اے ہمارے رب ! ہم پر صبر انڈیل دے اور ہمارے قدم اِنَّكَ اَنْتَ الْوَھَّابُ۝ثابت رکھ اور ان کافر لوگوں کے خلاف ہماری مدد فرما۔
(259سورة البقرة : )
:دوسری دعا
رَبَّنَا لاَ تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ ھَدَیْتَنَا وَھَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَةً اِنَّكَ
اے ہمارے رب ! ہمارے دل ٹیڑھے نہ کر، اس کے بعد اَنْتَ الْوَھَّابُ
کہ تو نے ہمیں ہدایت دی اور ہمیں اپنے پاس سے رحمت
عطا فرما، بیشک تو ہی بےحد عطا کرنے والا ہے۔ (آل
)8عمران:
:گناہوں سے بخشش کی دعا
 اَلَّذِیْنَ یَقُوْلُوْنَ رَبَّنَا اِنَّنَا اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَقِنَا عَذَابَ النَّارِ
اے ہمارے رب ! بیشک ہم ایمان لے آئے، سو ہمیں ہمارے
(آل گناه بخش دے اور ہمیں آگ کے عذاب سے بچا۔
)16عمران:
:انسان بے بس ہو جائے تو یہ دعا پڑھےاِنَّمَآ اَشْكُوْا بَثِّيْ وَحُزْنِيْٓ اِلَى اللهِ
میں تو اپنی ظاہر ہوجانے والی بےقراری اور اپنے غم کی
86یوسف:)شکایت صرف الله کی جناب میں کرتا ہوں۔
:دوسری دعا
ۚ فَاطِرَ السَّمٰوٰتِ ٠وَعَلَّمْتَنِيْ مِنْ تَاْوِیْلِ الاَْحَادِیْثِ۝ۚ تَوَفَّنِيْ مُسْلِمًا ٠ ۣاَنْتَ وَلِيّٖ فِي الدُّنْیَا وَالاْٰخِرَةِ٠۝وَالاَْرْضِ۝وَّاَلْحِقْنِيْ بِالصّٰلِحِیْنَ۝مجھے الله ہی کافی ہے، اس کے سوا کوئی معبود نہیں، میں
نے اسی پر بھروسا کیا اور وہی عرش عظیم کا رب
129ہے۔(التوبہ:
شیطان سے حفاظت کیلئے:آیت الکرسی
٠ ۚاَلْـحَيُّ الْقَیُّوْمُ لاَ تَاْخُذُهٗ سِـنَۃٌ وَّلاَ نَوْمٌ٠۝اللهَُ لآَ اِلٰہَ اِلاَّ ھُوَ۝ ۭ مَنْ ذَا الَّذِيْ یَشْفَعُ عِنْدَهٗٓ ٠لَہٗ مَا فِي السَّمٰوٰتِ وَمَا فِي الاَْرْضِ۝ۚ وَلاَ یُحِیْطُوْنَ ٠ ۭیَعْلَمُ مَا بَیْنَ اَیْدِیْہِمْ وَمَا خَلْفَھُمْ٠۝اِلاَّ بِـاِذْنِہٖ۝ۚ وَسِعَ كُرْسِـیُّہُ السَّمٰوٰتِ ٠بِشَيْءٍ مِّنْ عِلْمِہٖٓ اِلاَّ بِمَا شَاۗءَ۝ۚ وَھُوَالْعَلِيُّ ٠ ۚوَلاَ یَـــــُٔـــوْدُهٗ حِفْظُہُمَا٠۝وَالاَْرْضَ۝الْعَظِیْمُ۝۝الله کے سوا کوئی معبود نہیں، وه زنده اور قائم رہنے
والا ہے، اسے نہ اونگھ آتی ہے اورنہ نیند، اسی کے لیے
ہے جوآسمانوں اور زمین میں ہے، کون ہے جو اس کی
اجازت کے بغیر اس کے سامنے شفاعت کرسکے، وه جانتا
ہے جو ان کے آگے اور پیچھے ہے، اور وه اس کے علم
میں سے کسی چیز کا احاطہ نہیں کر سکتے سوائے اس
کے جو وه چاہے، اس کی کرسی آسمانوں اور زمین تک
وسیع ہے اور ان کی حفاظت اسے نہیں تھکاتی اور وه بہت
بلند اور بہت عظمت والا ہے۔
:سورة البقرة کی آخری دو آیاتۭ كُلٌّ اٰمَنَ ٠اٰمَنَ الرَّسُوْلُ بِمَآ اُنْزِلَ اِلَیْہِ مِنْ رَّبِّہٖ وَالْمُؤْمِنُوْنَ۝ۣ لاَ نُفَرِّقُ بَیْنَ اَحَدٍ مِّنْ رُّسُلِہٖ ٠بِاِ وَمَلٰۗىِٕكَتِہٖ وَكُتُبِہٖ وَرُسُلِہٖ ۝ۤۡ غُفْرَانَكَ رَبَّنَا وَاِلَیْكَ ٠ ۣ وَقَالُوْا سَمِعْنَا وَاَطَعْنَا۝٠
ۭ لَہَا مَا كَسَبَتْ ٠الْمَصِیْرُ۝لاَ یُكَلِّفُ اللهُ نَفْسًا اِلاَّ وُسْعَہَا۝ۚ ٠ ۭرَبَّنَا لاَ تُؤَاخِذْنَآ اِنْ نَّسِیْنَآ اَوْ اَخْطَاْنَا٠۝وَعَلَیْہَا مَااكْتَسَبَتْ۝ۚ ٠رَبَّنَا وَلاَ تَحْمِلْ عَلَیْنَآ اِصْرًا كَـمَا حَمَلْتَہٗ عَلَي الَّذِیْنَ مِنْ قَبْلِنَا۝۪ اَنْتَ مَوْلٰىنَا فَانْصُرْنَا عَلَي الْقَوْمِ ٠ ۪وَارْحَمْنَا ٠۝وَاغْفِرْ لَنَا ۝ ۪٠ ۚوَاعْفُ عَنَّا ٠۝ر َبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَۃَ لَنَا بِہٖ۝الْكٰفِرِیْنَ۝رسول ایمان لایا اس پرجو اس کے رب کی طرف سے نازل
کیا گیااور سب مومن بھی ،سب کے سب ایمان لائے الله
پر،اس کے فرشتوں پر،اس کی کتابوں پراوراس کے
رسولوں پر ۔ ہم اس کے رسولوں میں سے کسی مینفرق
نہیں کرتے اور وه کہتے ہیں ہم نے سنا اور ہم نے اطاعت
کی، تیری بخشش (مانگتے ہیں )اے ہمارے رب اور تیری
طرف ہی لوٹنا ہے۔الله کسی کو اس کی طاقت سے زیاده
تکلیف نہیں دیتا،اسی کے لیے ہے جو اس نے (نیکی) کی
اور اس پر ہے جو اس نے (گناه )کمایا،اے ہمارے رب!
اگر ہم بھول جائیں یا ہم خطا کر لیں تو ہمیں نہ پکڑنا،اے
ہمارے رب !ہم پر وه بوجھ نہ ڈال جیسا کہ تونے ہم سے
پہلے لوگوں پر ڈالا ، اے ہمارے رب! توہم سے وه بوجھ نہ
اٹھواجس کے اٹھانے کی طاقت ہم میں نہیں ، ہم سے
درگزر فرما اور ہمیں بخش دے اورہم پر رحم فرما،تو ہی 
ہمارا مولا ہے پس کافر قوم کے مقابلے میں ہماری مدد
فرما۔`